rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
/**
 * ESP32-C6 SuperMini + PZEM-004T v4 + LCD I2C 16x2
 * MQTT broker robotic: 10.5.2.222:1883 (lokal Tracked → MQTT_HOST_LOCAL)
 *
 * Continuity KPI (selaras LCD <-> backend <-> dashboard):
 *   - kpi_source=esp: counter ESP = sumber → dashboard & LCD sama
 *   - kpi_source=telemetry: dashboard dari DB → MQTT sync_kpi ke LCD
 *   - set_calibration / set_display dari backend (NVS di ESP)
 *   - Reset dashboard -> MQTT reset_day -> ESP nol -> LCD & dashboard 0
 *   - Deep sleep: OFF ≥ 2 jam → wajib MQTT dulu (reboot 1× jika belum connect),
 *     kirim deep_sleep_enter, sleep 20 mnt; bangun → WiFi+MQTT → kirim OFF →
 *     tunggu 5 mnt; masih OFF → sleep lagi; ON → deep_sleep_exit
 *   - Counter Run/Loss/Off tetap jalan + NVS saat WiFi putus; MQTT sync saat nyambung
 *   - LCD saat reconnect: 2 slide (Reconnect Wifi · Runn/Loss)
 *
 * Topics (sama protokol backend-rust):
 *   iot/gistex/{CODE}/telemetry/pzem
 *   iot/gistex/{CODE}/status/pzem
 *   iot/gistex/{CODE}/cmd | ack
 *   iot/gistex/dev/{UID}/cmd          — channel stabil (code bisa berubah dinamis)
 *   cmd: set_identity | set_network | set_calibration | set_display | sync_kpi
 *        | set_login_system | data_saved
 * System Login ON → wajib login harian; OFF → KPI langsung jalan
 * LCD: boot → UID besar 2 digit (00) → MAC ADDRESS → baru WiFi
 * LCD: jika belum login → 2 slide: (1) OPERATOR BELUM/MELAKUKAN LOGIN (2) nama mesin + UID
 * LCD slides setelah login (auto 4 dtk):
 *   1 Loss/Runn · 2 Brand+Proses + kode · 3 OFF/IDLE · 4 Voltage/Current
 *
 * Wiring:
 *   PZEM UART1  ESP RX=GPIO17 <- PZEM TX
 *               ESP TX=GPIO16 -> PZEM RX
 *               GND bersama, PZEM L/N ke AC
 *   LCD I2C     SDA=GPIO20  SCL=GPIO19  VCC=3V3/5V  addr 0x27
 *   BTN page    GPIO9 -> GND (INPUT_PULLUP), tap = ganti halaman LCD
 *   BTN reset   GPIO10 -> GND, tahan 2 dtk = reset counter hari ini
 *
 * Board Arduino IDE: "ESP32C6 Dev Module" / SuperMini C6
 * Library: PubSubClient, ArduinoJson, PZEM004Tv30, LiquidCrystal_I2C
 *          Preferences (built-in ESP32) untuk NVS
 */

 #include <WiFi.h>
 #include <PubSubClient.h>
 #include <ArduinoJson.h>
 #include <PZEM004Tv30.h>
 #include <Wire.h>
 #include <LiquidCrystal_I2C.h>
 #include <Preferences.h>
 #include <time.h>
 #include <esp_wifi.h>
 #include <esp_idf_version.h>
 #include <esp_sleep.h>
 
 // ===================== CONFIG (default flash; bisa diubah dashboard → NVS) =====================
static const char *DEFAULT_WIFI_SSID = "Tracked (9)";
static const char *DEFAULT_WIFI_PASS = "Factory@RFID";
static const char *MQTT_HOST_ROBOTIC = "10.5.2.222";   // Broker robotic (Tracked)
static const uint16_t MQTT_PORT_ROBOTIC = 1883;

/** Cadangan: hanya dipakai setelah primary gagal ≥ 30 menit */
static const char *DEFAULT_WIFI_SSID_FALLBACK = "GM3_DuckDown";
static const char *DEFAULT_WIFI_PASS_FALLBACK = "Factory@Maja";
static const char *MQTT_HOST_LOCAL = "10.5.0.106";      // Broker saat WiFi cadangan / lokal
static const uint16_t MQTT_PORT_LOCAL = 1883;

// Default awal MQTT (dinamis disesuaikan SSID)
static const char *DEFAULT_MQTT_HOST = MQTT_HOST_ROBOTIC;
static const uint16_t MQTT_PORT = 1883;
// WiFi boot awal timeout
static const uint32_t BOOT_WIFI_TIMEOUT_MS = 12000;  // 12 detik
 static const char *DEFAULT_MACHINE_CODE = "JUKI011";
 static const char *DEFAULT_DEVICE_UID = "011";
 /** true = wajib login operator; false = KPI jalan tanpa login (default firmware) */
 static const bool DEFAULT_LOGIN_REQUIRED = false;
 /** Bump saat ganti DEFAULT_LOGIN_REQUIRED agar NVS sysOn ikut reset */
 static const uint8_t LOGIN_DEFAULT_REV = 2;
 static const char *TOPIC_PREFIX = "iot/gistex";
 static const char *SENSOR_NAME = "pzem";
 
 // Runtime identity (dinamis dari MQTT / NVS)
 char wifiSsid[48];
 char wifiPass[48];
 char mqttHost[48];
 char machineCode[24];
 char deviceUid[24];
 char mqttClientId[40];
 bool wifiCredsDirty = false;  // reconnect WiFi setelah set_network
 bool mqttNeedsReconnect = false;
 
 // Pin ESP32-C6 SuperMini (sesuai wiring board)
 #define SDA_PIN     20
 #define SCL_PIN     19
 #define PZEM_RX_PIN 17  // Dihubungkan ke TX PZEM
 #define PZEM_TX_PIN 16  // Dihubungkan ke RX PZEM
 #define I2C_SDA     SDA_PIN
 #define I2C_SCL     SCL_PIN
 #define BTN_PAGE    9
 #define BTN_RESET   10
 #define LCD_ADDR    0x27
 
 // Timing
 static const uint32_t PZEM_MS = 500;
 static const uint32_t TELEMETRY_MS = 1000;
 static const uint32_t STATUS_MS = 5000;
 static const uint32_t LCD_MS = 250;
 static const uint32_t LCD_PAGE_AUTO_MS = 4000;  // 4 dtk per slide
 static const uint32_t LCD_SCROLL_MS = 350;
 static const uint32_t WIFI_RETRY_MS = 8000;              // retry SSID yang sama
 static const uint32_t WIFI_PRIMARY_ONLY_MS = 30UL * 60UL * 1000UL;  // 30 mnt baru ke cadangan
 static const uint32_t WIFI_FALLBACK_RETRY_MS = 10UL * 60UL * 1000UL; // 10 mnt di cadangan lalu balik primary
 /** Watchdog sinyal lemah: roam ke BSSID lebih kuat (anti putus di area noise) */
 static const int8_t WIFI_RSSI_ROAM_DBM = -85;           // lebih ketat: jangan roam terlalu sering
 static const int8_t WIFI_RSSI_ROAM_IMPROVE_DB = 8;      // hanya roam jika ≥8 dB lebih kuat
 static const uint8_t WIFI_RSSI_BAD_HITS = 5;            // butuh lebih banyak sampel jelek
 static const uint32_t WIFI_RSSI_CHECK_MS = 15000;
 static const uint32_t MQTT_RETRY_MS = 5000;       // jeda awal reconnect (jangan spam)
 static const uint32_t MQTT_RETRY_MAX_MS = 120000; // max backoff 2 mnt
 static const uint16_t MQTT_KEEPALIVE_SEC = 60;    // 60s: lebih tahan WiFi noise / scan singkat
 static const uint16_t MQTT_SOCKET_TIMEOUT_SEC = 15;
 /** Setelah MQTT nyambung, tahan roam WiFi agar tidak putus-nyambung */
 static const uint32_t MQTT_STABLE_BEFORE_ROAM_MS = 5UL * 60UL * 1000UL;
 static const uint32_t WIFI_ROAM_COOLDOWN_MS = 5UL * 60UL * 1000UL;
 static const uint32_t BTN_DEBOUNCE_MS = 40;
 static const uint32_t BTN_LONG_MS = 2000;
 static const uint32_t NVS_SAVE_MS = 10000;  // simpan flash max tiap 10 dtk (hemat wear)
 static const uint32_t RECOVERY_REBOOT_MS = 10 * 60 * 1000UL; // 10 menit gagal konek total -> reboot self-heal
 /** Mesin OFF terus selama ini → deep sleep (wajib MQTT dulu) */
 static const uint32_t OFF_BEFORE_SLEEP_MS = 2UL * 60UL * 60UL * 1000UL;  // 2 jam
 /** Timer wake */
 static const uint64_t DEEP_SLEEP_US = 20ULL * 60ULL * 1000000ULL;  // 20 menit
 static const uint32_t SLEEP_CHUNK_SEC = 20UL * 60UL;
 /** Setelah bangun + MQTT: pantau mesin ON selama ini sebelum sleep lagi */
 static const uint32_t DS_WAKE_WATCH_MS = 5UL * 60UL * 1000UL;  // 5 menit
 
 uint32_t mqttBackoffMs = MQTT_RETRY_MS;
 
 // Threshold deteksi — disinkron dari dashboard via MQTT set_calibration
 float currentThresholdA = 0.6f;  // Running ≥ A (dashboard bisa override)
 float offCurrentA = 0.01f;       // Mati jika A < off; Idle = off…thr (dashboard bisa override)
 float powerThresholdW = 0.0f;  // 0 = off, deteksi hanya dari arus
 float voltageOnV = 180.0f;
 uint32_t filterAktifMs = 1500;
 uint32_t filterDiamMs = 1500;
 uint32_t lcdAutoMs = LCD_PAGE_AUTO_MS;
 bool kpiFromBackend = false;  // true = LCD tampil angka dari backend
 bool loginSystemOn = DEFAULT_LOGIN_REQUIRED;  // wajib login (default kode / NVS / dashboard)
 bool operatorLoggedIn = false;  // login harian (WIB)
 int loginWibYmd = -1;
 char lcdFlashScroll[48];        // running text overlay 5 dtk
 bool lcdFlashScrollOn = false;
 char lcdName[40] = "";      // machine name / Brand+Proses
 char lcdProcess[40] = "";   // proses saja
 char lcdOperator[40] = "";  // nama operator aktif (tanpa code mesin)
 char lcdBranch[24] = "";
 char lcdLine[24] = "";
 char lcdLocation[32] = "";
 char lcdGarmentStyle[24] = "";
 uint32_t lastDesiredRevision = 0;  // NVS: hindari apply ulang retained lama
 uint8_t lcdScrollPos = 0;
 uint32_t lastScrollMs = 0;
 
 // NTP WIB = UTC+7
 static const long GMT_OFFSET_SEC = 7 * 3600;
 static const int DAYLIGHT_OFFSET_SEC = 0;
 static const char *NTP_SERVER = "pool.ntp.org";
 // ==================================================
 
 HardwareSerial PZEM_UART(1);
 PZEM004Tv30 pzem(PZEM_UART, PZEM_RX_PIN, PZEM_TX_PIN);
 LiquidCrystal_I2C lcd(LCD_ADDR, 16, 2);
 WiFiClient wifiClient;
 PubSubClient mqtt(wifiClient);
 Preferences prefs;
 
 char topicTelemetry[96];
 char topicStatus[96];
 char topicCmd[96];
 char topicDevCmd[96];  // iot/gistex/dev/{UID}/cmd
 char topicDesired[96];     // retained desired_state per machine code
 char topicDevDesired[96];  // retained desired_state per UID
 char topicLcdState[96];    // retained login_status / lcd snapshot
 char topicAck[96];
 char topicHistory[96];       // iot/gistex/{CODE}/history
 char topicHistoryDaily[96];  // iot/gistex/{CODE}/history/daily
 char willPayload[220];

