rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
// ===== 7-Day (1 Minggu) History Memory di NVS =====
struct DailyHistoryEntry {
  int ymd;             // YYYYMMDD (contoh: 20260821)
  uint32_t runSec;     // RUNNING detik
  uint32_t lossSec;    // LOSS / IDLE detik
  uint32_t offSec;     // OFF detik
  uint32_t powerOnSec; // runSec + lossSec
  float prodPct;       // (runSec / powerOnSec) * 100%
  uint32_t savedAt;    // Unix timestamp snapshot 00:00
};

static const uint8_t MAX_HISTORY_DAYS = 7;
DailyHistoryEntry dailyHistory[MAX_HISTORY_DAYS];
uint8_t dailyHistoryCount = 0;
 
 enum OpStatus : uint8_t { ST_OFF = 0, ST_IDLE = 1, ST_RUNNING = 2 };
 enum LcdPage : uint8_t {
   PAGE_RUNLOSS = 0,   // Slide 1: Loss / Runn
   PAGE_IDENTITY = 1,  // Slide 2: Operator / Proses
   PAGE_OFFIDLE = 2,   // Slide 3: OFF / IDLE
   PAGE_VI = 3,        // Slide 4: Voltage / Current
   PAGE_LOCATION = 4,  // Slide 5: Line / Branch (dari backend)
   PAGE_COUNT = 5
 };
 
 OpStatus opStatus = ST_OFF;
 OpStatus pendStatus = ST_OFF;
 uint32_t pendSinceMs = 0;
 LcdPage lcdPage = PAGE_RUNLOSS;
 bool lcdManualHold = false;
 uint32_t loginFlashUntilMs = 0;  // LCD flash sampai millis ini
 char lcdLoginLine1[17];
 char lcdLoginLine2[17];
 
 uint32_t runSec = 0;
 uint32_t lossSec = 0;  // idle berarus
 uint32_t offSec = 0;
 uint32_t lastTickMs = 0;
 int lastWibYmd = -1;  // YYYYMMDD
 
 uint32_t nvsRun = 0, nvsLoss = 0, nvsOff = 0;
 uint32_t lastNvsSaveMs = 0;
 bool countersDirty = false;
 
 float lastV = 0, lastA = 0, lastW = 0, lastE = 0, lastHz = 0, lastPf = 0;
 bool pzemOk = false;
 uint16_t pzemFailCount = 0;
 uint16_t mqttFailCount = 0;
 uint16_t wifiFailCount = 0;
 
 bool wifiWasOk = false;
 bool mqttWasOk = false;
 bool ipReportedOnce = false;  // IP hanya dikirim 1x per sesi MQTT connect
 bool ntpOk = false;
 String lastState = "boot";
 
 uint32_t lastPzemMs = 0;
 uint32_t lastTelemetryMs = 0;
 uint32_t lastStatusMs = 0;
 uint32_t lastLcdMs = 0;
 uint32_t lastPageAutoMs = 0;
 uint32_t lastWifiAttemptMs = 0;
 enum WifiPhase : uint8_t { WP_PRIMARY = 0, WP_FALLBACK = 1 };
 WifiPhase wifiPhase = WP_PRIMARY;
 uint32_t wifiTryStartMs = 0;
 uint32_t wifiDownSinceMs = 0;  // mulai putus terus (untuk timer 30 mnt)
 bool wifiAllFailed = false;
 uint32_t lastRssiCheckMs = 0;
 uint8_t wifiRssiBadHits = 0;
 uint32_t lastMqttAttemptMs = 0;
 uint32_t mqttConnectedAtMs = 0;   // kapan MQTT terakhir sukses connect
 uint32_t lastWifiRoamMs = 0;
 bool mqttEverConnected = false;   // false = boot pertama (clean session)
 uint32_t offlineSinceMs = 0;
 uint32_t offSinceMs = 0;  // millis saat mulai OFF terus (untuk deep sleep)
 bool dsPendingExit = false;  // bangun sleep + mesin ON → publish exit setelah MQTT
 bool dsWakeWatch = false;    // bangun sleep, tunggu 5 mnt dengan WiFi/MQTT
 uint32_t dsWatchStartMs = 0; // 0 = belum mulai (tunggu MQTT)
 
 bool btnPagePrev = true;
 bool btnResetPrev = true;
 uint32_t btnPageDownMs = 0;
 uint32_t btnResetDownMs = 0;
 
 void publishTelemetry();
 void saveCounters(bool force);
 void wifiResetCycle();
 void wifiBeginCurrent();
 void loadCalibration();
 void saveCalibration();
 void loadLoginState();
 void enterDeepSleep(const char *reason, bool firstEnter);
 void handleDeepSleepWake();
 void publishDeepSleepEvent(const char *state, uint32_t fromEpoch, uint32_t toEpoch);
 void tryPublishDeepSleepExit();
 void serviceDeepSleepLogic();
 bool tryEnterDeepSleepWithMqtt(const char *reason, bool firstEnter);
 OpStatus classify(float v, float a, float w, bool ok);
 static const char *statusStr(OpStatus s);
 void saveLoginState();
 void setOperatorLoggedIn(bool ok, bool flashAck);
 void clearOperatorLogin(const char *reason);
 void loadIdentity();
 void saveIdentity();
 void buildTopics();
 void applyIdentity(const char *code, const char *uid);
 void resubscribeMqtt();
 bool applyDesiredState(JsonDocument &doc);
 void applyStatusFilter(OpStatus raw);
 void publishConfigAck(const char *cmd);
 void publishWifiScanAck();
 void publishLoginSystemFeedback();
 void updateMqttHostForSsid(const char *ssid);
 void syncMqttHostFromWifi();
 void wifiMacString(char out[18]);
 void wifiMacLcdString(char out[17]);
 
 int wibYmdNow() {
   struct tm ti;
   if (!getLocalTime(&ti, 50)) return -1;
   return (ti.tm_year + 1900) * 10000 + (ti.tm_mon + 1) * 100 + ti.tm_mday;
 }
 
 void buildMqttClientId() {
   // Unik per board: hindari bentrok client_id (penyebab kick ↔ reconnect loop)
   uint16_t chip = (uint16_t)(ESP.getEfuseMac() & 0xFFFF);
   snprintf(mqttClientId, sizeof(mqttClientId), "%s-%s-%04X", machineCode, deviceUid, chip);
 }
 
 void loadIdentity() {
   strncpy(wifiSsid, DEFAULT_WIFI_SSID, sizeof(wifiSsid) - 1);
   strncpy(wifiPass, DEFAULT_WIFI_PASS, sizeof(wifiPass) - 1);
   strncpy(mqttHost, DEFAULT_MQTT_HOST, sizeof(mqttHost) - 1);
   strncpy(machineCode, DEFAULT_MACHINE_CODE, sizeof(machineCode) - 1);
   strncpy(deviceUid, DEFAULT_DEVICE_UID, sizeof(deviceUid) - 1);
   wifiSsid[sizeof(wifiSsid) - 1] = 0;
   wifiPass[sizeof(wifiPass) - 1] = 0;
   mqttHost[sizeof(mqttHost) - 1] = 0;
   machineCode[sizeof(machineCode) - 1] = 0;
   deviceUid[sizeof(deviceUid) - 1] = 0;
 
   // NVS override (dari set_identity / set_network dashboard)
   char tmp[48];
   prefs.begin("pzemid", true);
   if (prefs.getString("ssid", tmp, sizeof(tmp)) > 0) {
     if (strcmp(tmp, "GM3_DuckDown") == 0 || strcmp(tmp, "Robot_Resource (Lokal)") == 0) {
       strncpy(wifiSsid, DEFAULT_WIFI_SSID, sizeof(wifiSsid) - 1);
       strncpy(wifiPass, DEFAULT_WIFI_PASS, sizeof(wifiPass) - 1);
     } else {
       strncpy(wifiSsid, tmp, sizeof(wifiSsid) - 1);
     }
     wifiSsid[sizeof(wifiSsid) - 1] = 0;
   }
   if (prefs.getString("pass", tmp, sizeof(tmp)) > 0) {
     if (strcmp(tmp, "Factory@Maja") == 0 || strcmp(tmp, "robot@9876") == 0) {
       strncpy(wifiPass, DEFAULT_WIFI_PASS, sizeof(wifiPass) - 1);
     } else {
       strncpy(wifiPass, tmp, sizeof(wifiPass) - 1);
     }
     wifiPass[sizeof(wifiPass) - 1] = 0;
   }
   if (prefs.getString("mhost", tmp, sizeof(tmp)) > 0) {
     strncpy(mqttHost, tmp, sizeof(mqttHost) - 1);
     mqttHost[sizeof(mqttHost) - 1] = 0;
   }
   if (prefs.getString("code", tmp, sizeof(tmp)) > 0) {
     strncpy(machineCode, tmp, sizeof(machineCode) - 1);
     machineCode[sizeof(machineCode) - 1] = 0;
   }
   if (prefs.getString("uid", tmp, sizeof(tmp)) > 0) {
     strncpy(deviceUid, tmp, sizeof(deviceUid) - 1);
     deviceUid[sizeof(deviceUid) - 1] = 0;
   }
   prefs.end();
 
   updateMqttHostForSsid(wifiSsid);
   buildMqttClientId();
 }
 
 void updateMqttHostForSsid(const char *ssid) {
  const char *targetHost = MQTT_HOST_LOCAL;
  if (ssid && (strstr(ssid, "Tracked") != nullptr || strcmp(ssid, DEFAULT_WIFI_SSID) == 0)) {
    targetHost = MQTT_HOST_ROBOTIC;  // Tracked → 10.5.2.222
  } else {
    targetHost = MQTT_HOST_LOCAL;    // GM3_DuckDown → 10.5.0.106
  }
  if (strcmp(mqttHost, targetHost) != 0) {
    strncpy(mqttHost, targetHost, sizeof(mqttHost) - 1);
    mqttHost[sizeof(mqttHost) - 1] = 0;
    mqtt.setServer(mqttHost, MQTT_PORT);
    mqttNeedsReconnect = true;
  }
}

void syncMqttHostFromWifi() {
  if (WiFi.status() == WL_CONNECTED) {
    updateMqttHostForSsid(WiFi.SSID().c_str());
  } else {
    updateMqttHostForSsid(wifiSsid);
  }
}

 void saveIdentity() {
   prefs.begin("pzemid", false);
   prefs.putString("ssid", wifiSsid);
   prefs.putString("pass", wifiPass);
   prefs.putString("mhost", mqttHost);
   prefs.putString("code", machineCode);
   prefs.putString("uid", deviceUid);
   prefs.end();
 }
 
 void buildTopics() {
   snprintf(topicTelemetry, sizeof(topicTelemetry), "%s/%s/telemetry/%s", TOPIC_PREFIX, machineCode, SENSOR_NAME);
   snprintf(topicStatus, sizeof(topicStatus), "%s/%s/status/%s", TOPIC_PREFIX, machineCode, SENSOR_NAME);
   snprintf(topicCmd, sizeof(topicCmd), "%s/%s/cmd", TOPIC_PREFIX, machineCode);
   snprintf(topicDevCmd, sizeof(topicDevCmd), "%s/dev/%s/cmd", TOPIC_PREFIX, deviceUid);
   snprintf(topicDesired, sizeof(topicDesired), "%s/%s/desired", TOPIC_PREFIX, machineCode);
   snprintf(topicDevDesired, sizeof(topicDevDesired), "%s/dev/%s/desired", TOPIC_PREFIX, deviceUid);
   snprintf(topicLcdState, sizeof(topicLcdState), "%s/%s/lcd_state", TOPIC_PREFIX, machineCode);
   snprintf(topicAck, sizeof(topicAck), "%s/%s/ack", TOPIC_PREFIX, machineCode);
   snprintf(topicHistory, sizeof(topicHistory), "%s/%s/history", TOPIC_PREFIX, machineCode);
   snprintf(topicHistoryDaily, sizeof(topicHistoryDaily), "%s/%s/history/daily", TOPIC_PREFIX, machineCode);
   snprintf(willPayload, sizeof(willPayload),
            "{\"device_uid\":\"%s\",\"machine_code\":\"%s\",\"sensor\":\"%s\",\"state\":\"mqtt_lost\",\"online\":false,\"detail\":\"MQTT LWT\"}",
            deviceUid, machineCode, SENSOR_NAME);
 }
 
