rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 void resubscribeMqtt() {
   if (!mqtt.connected()) return;
   mqtt.subscribe(topicCmd);
   mqtt.subscribe(topicDevCmd);
   // Retained: backend push saat ESP offline → apply otomatis saat subscribe
   mqtt.subscribe(topicDesired);
   mqtt.subscribe(topicDevDesired);
   mqtt.subscribe(topicLcdState);
 }
 
 void applyIdentity(const char *code, const char *uid) {
   bool changed = false;
   if (code && code[0] && strcmp(code, machineCode) != 0) {
     strncpy(machineCode, code, sizeof(machineCode) - 1);
     machineCode[sizeof(machineCode) - 1] = 0;
     changed = true;
   }
   if (uid && uid[0] && strcmp(uid, deviceUid) != 0) {
     strncpy(deviceUid, uid, sizeof(deviceUid) - 1);
     deviceUid[sizeof(deviceUid) - 1] = 0;
     changed = true;
   }
   if (!changed) return;
 
   buildMqttClientId();
   if (mqtt.connected()) {
     mqtt.unsubscribe(topicCmd);
     mqtt.unsubscribe(topicDevCmd);
     mqtt.unsubscribe(topicDesired);
     mqtt.unsubscribe(topicDevDesired);
     mqtt.unsubscribe(topicLcdState);
   }
   buildTopics();
   saveIdentity();
   mqttNeedsReconnect = true;  // client id / LWT perlu connect ulang
 }
 
 void loadCalibration() {
   prefs.begin("pzemcal", true);
   currentThresholdA = prefs.getFloat("thrA", currentThresholdA);
   offCurrentA = prefs.getFloat("offA", offCurrentA);
   powerThresholdW = prefs.getFloat("thrW", powerThresholdW);
   voltageOnV = prefs.getFloat("von", voltageOnV);
   filterAktifMs = prefs.getUInt("fAktif", filterAktifMs);
   filterDiamMs = prefs.getUInt("fDiam", filterDiamMs);
   lcdAutoMs = prefs.getUInt("lcdAuto", lcdAutoMs);
   if (lcdAutoMs == 5000) lcdAutoMs = LCD_PAGE_AUTO_MS;  // migrasi default lama 5s → 4s
   if (lcdAutoMs < 4000) lcdAutoMs = 4000;  // min 4 dtk per slide
   kpiFromBackend = prefs.getBool("kpiBe", false);
   prefs.getString("lcdName", lcdName, sizeof(lcdName));
   prefs.getString("lcdProc", lcdProcess, sizeof(lcdProcess));
   prefs.getString("lcdBranch", lcdBranch, sizeof(lcdBranch));
   prefs.getString("lcdLine", lcdLine, sizeof(lcdLine));
   prefs.getString("lcdLoc", lcdLocation, sizeof(lcdLocation));
   prefs.getString("lcdStyle", lcdGarmentStyle, sizeof(lcdGarmentStyle));
   lastDesiredRevision = prefs.getUInt("dsRev", 0);
   prefs.end();
   // migrasi default lama 0.03 → 0.01 (Idle/MSN ON mulai di atas 0.01 A)
   bool offMigrated = false;
   if (offCurrentA >= 0.02f && offCurrentA <= 0.04f) {
     offCurrentA = 0.01f;
     offMigrated = true;
   }
   if (offMigrated) saveCalibration();
 }
 
 void saveCalibration() {
   prefs.begin("pzemcal", false);
   prefs.putFloat("thrA", currentThresholdA);
   prefs.putFloat("offA", offCurrentA);
   prefs.putFloat("thrW", powerThresholdW);
   prefs.putFloat("von", voltageOnV);
   prefs.putUInt("fAktif", filterAktifMs);
   prefs.putUInt("fDiam", filterDiamMs);
   prefs.putUInt("lcdAuto", lcdAutoMs);
   prefs.putBool("kpiBe", kpiFromBackend);
   prefs.putString("lcdName", lcdName);
   prefs.putString("lcdProc", lcdProcess);
   prefs.putString("lcdBranch", lcdBranch);
   prefs.putString("lcdLine", lcdLine);
   prefs.putString("lcdLoc", lcdLocation);
   prefs.putString("lcdStyle", lcdGarmentStyle);
   prefs.putUInt("dsRev", lastDesiredRevision);
   prefs.end();
 }
 
 void loadLoginState() {
   prefs.begin("pzemlogin", false);
   uint8_t rev = prefs.getUChar("sysRev", 0);
   operatorLoggedIn = prefs.getBool("ok", false);
   loginWibYmd = (int)prefs.getInt("ymd", -1);
   if (rev != LOGIN_DEFAULT_REV) {
     // Firmware default berubah → paksa sysOn dari kode, bukan NVS lama
     loginSystemOn = DEFAULT_LOGIN_REQUIRED;
     prefs.putUChar("sysRev", LOGIN_DEFAULT_REV);
     prefs.putBool("sysOn", loginSystemOn);
   } else {
     loginSystemOn = prefs.getBool("sysOn", DEFAULT_LOGIN_REQUIRED);
   }
   prefs.end();
   // System Login OFF → jangan tampil "OPERATOR BELUM…"
   if (!loginSystemOn) {
     operatorLoggedIn = true;
     if (loginWibYmd < 0) {
       int ymd = wibYmdNow();
       loginWibYmd = ymd > 0 ? ymd : 0;
     }
     saveLoginState();
   }
 }
 
 void saveLoginState() {
   prefs.begin("pzemlogin", false);
   prefs.putBool("ok", operatorLoggedIn);
   prefs.putInt("ymd", loginWibYmd);
   prefs.putBool("sysOn", loginSystemOn);
   prefs.end();
 }
 
 void clearOperatorLogin(const char *reason) {
   // System Login OFF → mesin tetap boleh jalan tanpa login harian
   if (!loginSystemOn) {
     operatorLoggedIn = true;
     int ymd = wibYmdNow();
     loginWibYmd = ymd > 0 ? ymd : 0;
     saveLoginState();
     return;
   }
   operatorLoggedIn = false;
   loginWibYmd = -1;
   saveLoginState();
 }
 
 void setOperatorLoggedIn(bool ok, bool /*flashAck*/) {
   int ymd = wibYmdNow();
   operatorLoggedIn = ok;
   loginWibYmd = ok ? (ymd > 0 ? ymd : loginWibYmd) : -1;
   if (ok && loginWibYmd < 0) loginWibYmd = 0;  // NTP belum: tetap tandai login sampai midnight check
   if (!ok) lcdOperator[0] = 0;
   saveLoginState();
 }
 
 void applyStatusFilter(OpStatus raw) {
   uint32_t now = millis();
   // Off segera (A < 0.01) — jangan biarkan Loss/Run nambah saat mesin mati
   if (raw == ST_OFF) {
     opStatus = ST_OFF;
     pendStatus = ST_OFF;
     pendSinceMs = now;
     return;
   }
   if (raw == opStatus) {
     pendStatus = raw;
     pendSinceMs = now;
     return;
   }
   if (raw != pendStatus) {
     pendStatus = raw;
     pendSinceMs = now;
     return;
   }
   uint32_t need = (raw == ST_RUNNING) ? filterAktifMs : filterDiamMs;
   if (need < 50) need = 50;
   if (now - pendSinceMs >= need) {
     opStatus = raw;
   }
 }
 
 void loadCounters() {
   prefs.begin("pzemkpi", true);
   runSec = prefs.getUInt("run", 0);
   lossSec = prefs.getUInt("loss", 0);
   offSec = prefs.getUInt("off", 0);
   lastWibYmd = prefs.getInt("ymd", -1);
   prefs.end();
   nvsRun = runSec;
   nvsLoss = lossSec;
   nvsOff = offSec;
   countersDirty = false;
 }
 
 void saveCounters(bool force) {
   uint32_t now = millis();
   bool changed = (runSec != nvsRun) || (lossSec != nvsLoss) || (offSec != nvsOff);
   if (!force && !changed) return;
   if (!force && (now - lastNvsSaveMs < NVS_SAVE_MS)) {
     countersDirty = true;
     return;
   }
 
   prefs.begin("pzemkpi", false);
   prefs.putUInt("run", runSec);
   prefs.putUInt("loss", lossSec);
   prefs.putUInt("off", offSec);
   if (lastWibYmd > 0) prefs.putInt("ymd", lastWibYmd);
   prefs.end();
 
   nvsRun = runSec;
   nvsLoss = lossSec;
   nvsOff = offSec;
   lastNvsSaveMs = now;
   countersDirty = false;
 }
 
 void markCountersDirty() {
   countersDirty = true;
 }
 
