rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 static const char *statusStr(OpStatus s) {
   switch (s) {
     case ST_RUNNING: return "running";
     case ST_IDLE: return "idle";
     default: return "off";
   }
 }
 
 void fmtHms(uint32_t sec, char *out, size_t n) {
   uint32_t h = sec / 3600;
   uint32_t m = (sec % 3600) / 60;
   uint32_t s = sec % 60;
   snprintf(out, n, "%02lu:%02lu:%02lu", (unsigned long)h, (unsigned long)m, (unsigned long)s);
 }
 
 float productivityPct() {
   uint32_t powerOn = runSec + lossSec;
   if (powerOn == 0) return 0;
   return (100.0f * runSec) / (float)powerOn;
 }
 
 void resetDayCounters(const char *reason) {
   runSec = 0;
   lossSec = 0;
   offSec = 0;
   lastTickMs = millis();
   saveCounters(true);
   clearOperatorLogin(reason);  // hari baru → wajib login lagi
 }
 
 // ===== 7-DAY NVS MEMORY IMPLEMENTATION =====
 void loadDailyHistory() {
   dailyHistoryCount = 0;
   memset(dailyHistory, 0, sizeof(dailyHistory));
   prefs.begin("pzemhist", true);
   uint8_t cnt = prefs.getUChar("cnt", 0);
   if (cnt > MAX_HISTORY_DAYS) cnt = MAX_HISTORY_DAYS;
   size_t readBytes = prefs.getBytes("data", dailyHistory, sizeof(dailyHistory));
   prefs.end();
   if (readBytes > 0) {
     dailyHistoryCount = cnt;
   }
 }
 
 void saveDailyHistory() {
   prefs.begin("pzemhist", false);
   prefs.putUChar("cnt", dailyHistoryCount);
   prefs.putBytes("data", dailyHistory, sizeof(dailyHistory));
   prefs.end();
 }
 
 void formatYmdDateStr(int ymd, char *out, size_t n) {
   if (ymd < 10000000) {
     snprintf(out, n, "1970-01-01");
     return;
   }
   int y = ymd / 10000;
   int m = (ymd % 10000) / 100;
   int d = ymd % 100;
   snprintf(out, n, "%04d-%02d-%02d", y, m, d);
 }
 
 void publishDailyHistorySnapshot(const DailyHistoryEntry &e) {
   if (!mqtt.connected()) return;
   char dateStr[16];
   formatYmdDateStr(e.ymd, dateStr, sizeof(dateStr));
 
   StaticJsonDocument<512> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["ymd"] = e.ymd;
   doc["date"] = dateStr;
   doc["run_sec"] = e.runSec;
   doc["loss_sec"] = e.lossSec;
   doc["idle_sec"] = e.lossSec;
   doc["off_sec"] = e.offSec;
   doc["power_on_sec"] = e.powerOnSec;
   doc["productivity_pct"] = e.prodPct;
   doc["saved_at"] = e.savedAt;
   doc["mqtt_service"] = mqttHost;
 
   char buf[512];
   size_t len = serializeJson(doc, buf);
   mqtt.publish(topicHistoryDaily, (const uint8_t *)buf, len, true);
 }
 
 void publishAllDailyHistory() {
   if (!mqtt.connected()) return;
   StaticJsonDocument<2048> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["command"] = "get_history";
   doc["count"] = dailyHistoryCount;
   doc["max_days"] = MAX_HISTORY_DAYS;
   doc["mqtt_service"] = mqttHost;
   JsonArray arr = doc.createNestedArray("history");
   for (uint8_t i = 0; i < dailyHistoryCount; i++) {
     char dateStr[16];
     formatYmdDateStr(dailyHistory[i].ymd, dateStr, sizeof(dateStr));
     JsonObject o = arr.createNestedObject();
     o["ymd"] = dailyHistory[i].ymd;
     o["date"] = dateStr;
     o["run_sec"] = dailyHistory[i].runSec;
     o["loss_sec"] = dailyHistory[i].lossSec;
     o["idle_sec"] = dailyHistory[i].lossSec;
     o["off_sec"] = dailyHistory[i].offSec;
     o["power_on_sec"] = dailyHistory[i].powerOnSec;
     o["productivity_pct"] = dailyHistory[i].prodPct;
     o["saved_at"] = dailyHistory[i].savedAt;
   }
 
   char buf[2048];
   size_t len = serializeJson(doc, buf);
   mqtt.publish(topicHistory, (const uint8_t *)buf, len, false);
 }
 
 void recordDailySnapshot(int ymd, uint32_t rSec, uint32_t lSec, uint32_t oSec) {
   if (ymd <= 0) return;
   int existingIdx = -1;
   for (uint8_t i = 0; i < dailyHistoryCount; i++) {
     if (dailyHistory[i].ymd == ymd) {
       existingIdx = i;
       break;
     }
   }
 
   DailyHistoryEntry entry;
   entry.ymd = ymd;
   entry.runSec = rSec;
   entry.lossSec = lSec;
   entry.offSec = oSec;
   entry.powerOnSec = rSec + lSec;
   entry.prodPct = (entry.powerOnSec > 0) ? ((100.0f * rSec) / (float)entry.powerOnSec) : 0.0f;
   time_t nowSec = 0;
   time(&nowSec);
   entry.savedAt = (uint32_t)nowSec;
 
   if (existingIdx >= 0) {
     dailyHistory[existingIdx] = entry;
   } else {
     if (dailyHistoryCount < MAX_HISTORY_DAYS) {
       dailyHistory[dailyHistoryCount++] = entry;
     } else {
       // Hapus yang tertua (> 7 hari), geser array ke kiri
       for (uint8_t i = 0; i < MAX_HISTORY_DAYS - 1; i++) {
         dailyHistory[i] = dailyHistory[i + 1];
       }
       dailyHistory[MAX_HISTORY_DAYS - 1] = entry;
     }
   }
   saveDailyHistory();
   publishDailyHistorySnapshot(entry);
 }
 
 // ---------- LCD ----------
 void lcdPrint2(const char *l1, const char *l2) {
   lcd.setCursor(0, 0);
   lcd.print(l1);
   for (int i = strlen(l1); i < 16; i++) lcd.print(' ');
   lcd.setCursor(0, 1);
   lcd.print(l2);
   for (int i = strlen(l2); i < 16; i++) lcd.print(' ');
 }
 
 /** Custom CGRAM untuk digit besar (tinggi 2 baris LCD). */
 void lcdLoadBigDigitChars() {
   // 0=LT 1=UB 2=RT 3=LL 4=LB 5=LR 6=UMB 7=LMB
   static const byte LT[8]  = {0b00111, 0b01111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111};
   static const byte UB[8]  = {0b11111, 0b11111, 0b11111, 0b00000, 0b00000, 0b00000, 0b00000, 0b00000};
   static const byte RT[8]  = {0b11100, 0b11110, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111};
   static const byte LL[8]  = {0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b01111, 0b00111, 0b00000};
   static const byte LB[8]  = {0b00000, 0b00000, 0b00000, 0b00000, 0b00000, 0b11111, 0b11111, 0b11111};
   static const byte LR[8]  = {0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11110, 0b11100, 0b00000};
   static const byte UMB[8] = {0b11111, 0b11111, 0b11111, 0b00000, 0b00000, 0b00000, 0b11111, 0b11111};
   static const byte LMB[8] = {0b11111, 0b00000, 0b00000, 0b00000, 0b00000, 0b11111, 0b11111, 0b11111};
   lcd.createChar(0, (uint8_t *)LT);
   lcd.createChar(1, (uint8_t *)UB);
   lcd.createChar(2, (uint8_t *)RT);
   lcd.createChar(3, (uint8_t *)LL);
   lcd.createChar(4, (uint8_t *)LB);
   lcd.createChar(5, (uint8_t *)LR);
   lcd.createChar(6, (uint8_t *)UMB);
   lcd.createChar(7, (uint8_t *)LMB);
 }
 
 /** Gambar satu digit 0–9, lebar 3 kolom × 2 baris, di kolom `col`. */
 void lcdDrawBigDigit(uint8_t col, char ch) {
   // top[3], bot[3] — indeks CGRAM atau ' ' / 0xFF block
   static const char TOP[10][3] = {
       {0, 1, 2}, {' ', 1, 2}, {6, 6, 2}, {6, 6, 2}, {3, 4, 2},
       {0, 6, 6}, {0, 6, 6}, {1, 1, 2}, {0, 6, 2}, {0, 6, 2},
   };
   static const char BOT[10][3] = {
       {3, 4, 5}, {' ', 4, 5}, {3, 7, 7}, {7, 7, 5}, {' ', ' ', 5},
       {7, 7, 5}, {3, 7, 5}, {' ', ' ', 5}, {3, 7, 5}, {7, 7, 5},
   };
   if (ch < '0' || ch > '9') return;
   int d = ch - '0';
   lcd.setCursor(col, 0);
   for (int i = 0; i < 3; i++) {
     char c = TOP[d][i];
     if (c == ' ') lcd.print(' ');
     else lcd.write((uint8_t)c);
   }
   lcd.setCursor(col, 1);
   for (int i = 0; i < 3; i++) {
     char c = BOT[d][i];
     if (c == ' ') lcd.print(' ');
     else lcd.write((uint8_t)c);
   }
 }
 
 /**
  * Splash nomor UID besar 2 digit (contoh 00 / 06) sebelum MAC & WiFi.
  */
 void showUidSplashLcd(uint32_t ms) {
   lcd.clear();
   lcdLoadBigDigitChars();
 
   char digits[8];
   int n = 0;
   for (int i = 0; deviceUid[i] && n < 7; i++) {
     if (deviceUid[i] >= '0' && deviceUid[i] <= '9') digits[n++] = deviceUid[i];
   }
   char d0 = '0', d1 = '0';
   if (n >= 2) {
     d0 = digits[n - 2];
     d1 = digits[n - 1];
   } else if (n == 1) {
     d1 = digits[0];
   }
   // 2 digit × lebar 3 + 1 spasi = 7 kolom, tengah 16
   lcdDrawBigDigit(4, d0);
   lcdDrawBigDigit(9, d1);
   delay(ms);
   lcd.clear();
 }
 
 void showMacSplashLcd(uint32_t ms) {
   WiFi.mode(WIFI_STA);
   char mac[17];
   wifiMacLcdString(mac);
   lcdPrint2("  MAC ADDRESS", mac);
   delay(ms);
   lcd.clear();
 }
 
