rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 /** Status koneksi WiFi / MQTT di LCD (boot & reconnect). */
 void showConnLcd(const char *title, const char *detail) {
   char a[17], b[17];
   snprintf(a, sizeof(a), "%.16s", title && title[0] ? title : "Connecting...");
   snprintf(b, sizeof(b), "%.16s", detail && detail[0] ? detail : " ");
   lcdPrint2(a, b);
 }
 
 /** Brand + Proses untuk slide identitas (nama mesin tampilan). */
 /** Proses murni (tanpa brand). Fallback terakhir ke machine_name. */
 void buildProcessOnly(char *out, size_t n) {
   if (lcdProcess[0]) {
     snprintf(out, n, "%s", lcdProcess);
   } else if (lcdName[0]) {
     snprintf(out, n, "%s", lcdName);
   } else {
     snprintf(out, n, "%s", " ");
   }
 }
 
 /** JUKI002 → JUKI-002 (sisipkan '-' sebelum digit). */
 void formatMachineLabel(char *out, size_t n) {
   int i = 0;
   while (machineCode[i] && !(machineCode[i] >= '0' && machineCode[i] <= '9')) i++;
   if (i > 0 && machineCode[i]) {
     snprintf(out, n, "%.*s-%s", i, machineCode, machineCode + i);
   } else {
     snprintf(out, n, "%s", machineCode);
   }
 }
 
 /** Ratakan teks di tengah 16 kolom LCD. */
 void centerLcd16(const char *src, char *out17) {
   size_t len = strlen(src);
   if (len >= 16) {
     memcpy(out17, src, 16);
     out17[16] = 0;
     return;
   }
   size_t pad = (16 - len) / 2;
   memset(out17, ' ', 16);
   out17[16] = 0;
   memcpy(out17 + pad, src, len);
 }
 
 /** Jendela 16 char dari teks panjang (running text). */
 void scrollWindow16(const char *text, char *out17) {
   size_t len = strlen(text);
   if (len <= 16) {
     snprintf(out17, 17, "%s", text);
     for (size_t i = len; i < 16; i++) out17[i] = ' ';
     out17[16] = 0;
     return;
   }
   // padding "  " di ujung agar loop mulus
   char padded[64];
   snprintf(padded, sizeof(padded), "%s  ", text);
   size_t plen = strlen(padded);
   if (plen == 0) {
     memset(out17, ' ', 16);
     out17[16] = 0;
     return;
   }
   uint8_t pos = lcdScrollPos % (uint8_t)plen;
   for (int i = 0; i < 16; i++) {
     out17[i] = padded[(pos + (uint8_t)i) % plen];
   }
   out17[16] = 0;
 }
 
 uint8_t lcdSlideCount() {
   if (WiFi.status() != WL_CONNECTED || !mqtt.connected()) return 2;
   uint8_t pages = (uint8_t)PAGE_COUNT;
   if (!lcdLine[0] && !lcdBranch[0] && !lcdLocation[0]) pages--;  // tanpa meta lokasi
   if (!loginSystemOn || operatorLoggedIn) return pages;
   return 2;
 }
 
 void flashLcdMsg(const char *l1, const char *l2) {
   lcdFlashScrollOn = false;
   lcdFlashScroll[0] = 0;
   snprintf(lcdLoginLine1, sizeof(lcdLoginLine1), "%.16s", l1 && l1[0] ? l1 : "Data Tersimpan");
   if (l2 && l2[0]) {
     snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "%.16s", l2);
   } else {
     snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "UID %s", deviceUid);
   }
   loginFlashUntilMs = millis() + 5000;
   renderLcd();
 }
 
 /** Pesan panjang → running text 5 detik (System Login On/Off). */
 void flashLcdScrollMsg(const char *longMsg, const char *l2) {
   strncpy(lcdFlashScroll, longMsg && longMsg[0] ? longMsg : "Data Tersimpan", sizeof(lcdFlashScroll) - 1);
   lcdFlashScroll[sizeof(lcdFlashScroll) - 1] = 0;
   // selalu running text agar pesan System Login terbaca penuh
   lcdFlashScrollOn = true;
   lcdScrollPos = 0;
   lastScrollMs = millis();
   lcdLoginLine1[0] = 0;
   if (l2 && l2[0]) {
     snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "%.16s", l2);
   } else {
     snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "UID %s", deviceUid);
   }
   loginFlashUntilMs = millis() + 5000;
   renderLcd();
 }
 
 void renderLcd() {
   char a[17], b[17], t1[10], t2[10], label[20], brandProc[48];
 
   // Overlay flash 5 detik (login / data saved / system login)
   if (loginFlashUntilMs != 0) {
     if (millis() < loginFlashUntilMs) {
       if (lcdFlashScrollOn && lcdFlashScroll[0]) {
         uint32_t now = millis();
         if (now - lastScrollMs >= LCD_SCROLL_MS) {
           lastScrollMs = now;
           lcdScrollPos++;
         }
         scrollWindow16(lcdFlashScroll, a);
         lcdPrint2(a, lcdLoginLine2[0] ? lcdLoginLine2 : " ");
       } else {
         lcdPrint2(
           lcdLoginLine1[0] ? lcdLoginLine1 : "Login Sukses",
           lcdLoginLine2[0] ? lcdLoginLine2 : " ");
       }
       return;
     }
     loginFlashUntilMs = 0;
     lcdFlashScrollOn = false;
     lcdFlashScroll[0] = 0;
     lcdLoginLine1[0] = 0;
     lcdLoginLine2[0] = 0;
   }
 
   // WiFi/MQTT belum siap → 2 slide: reconnect + Run/Loss (counter tetap jalan)
   if (wifiAllFailed && WiFi.status() != WL_CONNECTED) {
     lcdPrint2("GAGAL KONEKSI", wifiPhase == WP_FALLBACK ? "Cadangan WiFi" : "Tracked WiFi");
     return;
   }
   if (WiFi.status() != WL_CONNECTED) {
     if (((uint8_t)lcdPage % 2) == 0) {
       showConnLcd("Reconnect Wifi", wifiSsid);
     } else {
       fmtHms(lossSec, t1, sizeof(t1));
       fmtHms(runSec, t2, sizeof(t2));
       snprintf(a, sizeof(a), "Loss : %s", t1);
       snprintf(b, sizeof(b), "Runn : %s", t2);
       lcdPrint2(a, b);
     }
     return;
   }
   if (!mqtt.connected()) {
     if (((uint8_t)lcdPage % 2) == 0) {
       showConnLcd(mqttFailCount > 0 ? "MQTT reconnect.." : "MQTT connecting", mqttHost);
     } else {
       fmtHms(lossSec, t1, sizeof(t1));
       fmtHms(runSec, t2, sizeof(t2));
       snprintf(a, sizeof(a), "Loss : %s", t1);
       snprintf(b, sizeof(b), "Runn : %s", t2);
       lcdPrint2(a, b);
     }
     return;
   }
 
   // System login ON + belum login → 2 slide peringatan (tanpa machine code)
   if (loginSystemOn && !operatorLoggedIn) {
     uint8_t p = (uint8_t)lcdPage % 2;
     if (p == 0) {
       lcdPrint2("OPERATOR BELUM", "MELAKUKAN LOGIN");
     } else {
       char top[20];
       snprintf(top, sizeof(top), "UID %s", deviceUid);
       centerLcd16(top, a);
       char uidLine[20];
       buildProcessOnly(uidLine, sizeof(uidLine));
       centerLcd16(uidLine, b);
       lcdPrint2(a, b);
     }
     return;
   }
 
   switch (lcdPage) {
     case PAGE_RUNLOSS: {
       // Slide 1: Loss / Runn
       fmtHms(lossSec, t1, sizeof(t1));
       fmtHms(runSec, t2, sizeof(t2));
       snprintf(a, sizeof(a), "Loss : %s", t1);
       snprintf(b, sizeof(b), "Runn : %s", t2);
       lcdPrint2(a, b);
       break;
     }
     case PAGE_IDENTITY: {
       // Slide 2: Atas=Operator, Bawah=Proses (tanpa brand, tanpa machine code)
       const char *op = lcdOperator[0] ? lcdOperator : "Belum Login";
       if (strlen(op) > 16) {
         uint32_t now = millis();
         if (now - lastScrollMs >= LCD_SCROLL_MS) {
           lastScrollMs = now;
           lcdScrollPos++;
         }
         scrollWindow16(op, a);
       } else {
         centerLcd16(op, a);
       }
       buildProcessOnly(brandProc, sizeof(brandProc));
       if (strlen(brandProc) > 16) {
         uint32_t now = millis();
         if (now - lastScrollMs >= LCD_SCROLL_MS) {
           lastScrollMs = now;
           lcdScrollPos++;
         }
         scrollWindow16(brandProc, b);
       } else {
         snprintf(b, sizeof(b), "%s", brandProc);
       }
       lcdPrint2(a, b);
       break;
     }
     case PAGE_OFFIDLE: {
       // Slide 3: mesin mati + mesin ON (idle) — 16 kolom
       // "MSN OFF:00:00:00" / "MSN ON :00:00:00"
       fmtHms(offSec, t1, sizeof(t1));
       fmtHms(lossSec, t2, sizeof(t2));
       snprintf(a, sizeof(a), "MSN OFF:%s", t1);
       snprintf(b, sizeof(b), "MSN ON :%s", t2);
       lcdPrint2(a, b);
       break;
     }
     case PAGE_VI: {
       // Slide 4: Voltage / Current (16 kolom, spasi seperti contoh)
       // "Voltage : 220 V" / "Current : 0.01 A"
       if (!pzemOk) {
         snprintf(a, sizeof(a), "Voltage :  --- V");
         snprintf(b, sizeof(b), "Current :  --- A");
       } else {
         snprintf(a, sizeof(a), "Voltage : %3.0f V", lastV);
         if (lastA < 10.0f) {
           snprintf(b, sizeof(b), "Current : %4.2f A", lastA);
         } else {
           snprintf(b, sizeof(b), "Current : %4.1f A", lastA);
         }
       }
       lcdPrint2(a, b);
       break;
     }
     case PAGE_LOCATION: {
       if (lcdLine[0] || lcdBranch[0]) {
         snprintf(a, sizeof(a), "Line: %.10s", lcdLine[0] ? lcdLine : "-");
         snprintf(b, sizeof(b), "Br: %.12s", lcdBranch[0] ? lcdBranch : "-");
       } else {
         snprintf(a, sizeof(a), "Loc: %.12s", lcdLocation[0] ? lcdLocation : "-");
         snprintf(b, sizeof(b), "UID %s", deviceUid);
       }
       lcdPrint2(a, b);
       break;
     }
     default:
       break;
   }
 }
 
