rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 // ---------- Deep sleep (OFF ≥ 2 jam → MQTT dulu → sleep 20 mnt → wake WiFi/MQTT → nunggu 5 mnt) ----------
 uint32_t epochNowOr0() {
   time_t t = time(nullptr);
   return (t > 100000) ? (uint32_t)t : 0;
 }
 
 void publishDeepSleepEvent(const char *state, uint32_t fromEpoch, uint32_t toEpoch) {
   if (!mqtt.connected()) return;
   StaticJsonDocument<480> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["sensor"] = SENSOR_NAME;
   doc["state"] = state;
   doc["online"] = (strcmp(state, "deep_sleep_exit") == 0);
   doc["wifi_ok"] = WiFi.status() == WL_CONNECTED;
   doc["mqtt_ok"] = true;
   doc["mqtt_service"] = mqttHost;
   doc["sensor_ok"] = pzemOk;
   doc["detail"] = (strcmp(state, "deep_sleep_enter") == 0)
                       ? "OFF ≥2 jam — deep sleep 20 mnt wake"
                       : (strcmp(state, "deep_sleep_wake") == 0)
                             ? "Bangun — cek OFF 5 mnt"
                             : "Bangun — mesin nyala lagi";
   doc["rssi"] = WiFi.RSSI();
   doc["uptime_sec"] = millis() / 1000;
   doc["run_sec"] = runSec;
   doc["loss_sec"] = lossSec;
   doc["off_sec"] = offSec;
   doc["op_status"] = statusStr(opStatus);
   if (fromEpoch > 0) doc["deep_sleep_from"] = fromEpoch;
   if (toEpoch > 0) doc["deep_sleep_to"] = toEpoch;
   if (fromEpoch > 0 && toEpoch > fromEpoch) {
     doc["duration_sec"] = toEpoch - fromEpoch;
   }
   char buf[480];
   size_t n = serializeJson(doc, buf);
   // retain enter supaya /devices tahu DEEPSLEEP
   bool retain = (strcmp(state, "deep_sleep_enter") == 0 || strcmp(state, "deep_sleep_exit") == 0);
   mqtt.publish(topicStatus, (const uint8_t *)buf, n, retain);
   lastState = state;
 }
 
 void deepSleepHardwareStart() {
   lcdPrint2("Deep sleep", "wake 20 min");
   delay(250);
   if (mqtt.connected()) mqtt.disconnect();
   WiFi.disconnect(true);
   WiFi.mode(WIFI_OFF);
   esp_sleep_enable_timer_wakeup(DEEP_SLEEP_US);
   esp_deep_sleep_start();
 }
 
 /** Wajib WiFi+MQTT sebelum sleep. Belum connect → reboot 1× lalu terus coba (jangan sleep). */
bool tryEnterDeepSleepWithMqtt(const char *reason, bool firstEnter) {
  (void)reason;
  syncMqttHostFromWifi();
  saveIdentity();
  if (mqttNeedsReconnect) {
    mqttNeedsReconnect = false;
    if (mqtt.connected()) mqtt.disconnect();
    mqtt.setServer(mqttHost, MQTT_PORT);
  }

  bool wifiOk = (WiFi.status() == WL_CONNECTED);
  bool mqttOk = mqtt.connected();
 
   if (!wifiOk || !mqttOk) {
     prefs.begin("pzemkpi", false);
     bool alreadyReboot = prefs.getBool("dsReb", false);
     prefs.putBool("dsWant", true);
     prefs.end();
 
     if (!alreadyReboot) {
       Serial.println("[DS] belum WiFi/MQTT → reboot 1x sebelum deep sleep");
       lcdPrint2("DS: reboot", "cari WiFi/MQTT");
       saveCounters(true);
       prefs.begin("pzemkpi", false);
       prefs.putBool("dsReb", true);
       prefs.putBool("dsWant", true);
       prefs.end();
       delay(500);
       ESP.restart();
     }
     // Sudah pernah reboot — jangan sleep dulu, terus coba connect
     lcdPrint2("DS tunggu", mqttOk ? "WiFi..." : "WiFi+MQTT...");
     return false;
   }
 
   // Sudah connect — kirim MQTT dulu baru sleep
   saveCounters(true);
   uint32_t nowEp = epochNowOr0();
   if (firstEnter) {
     prefs.begin("pzemkpi", false);
     prefs.putBool("dsOn", true);
     prefs.putULong("dsFrom", nowEp);
     prefs.putULong("dsLast", nowEp);
     prefs.putBool("dsWant", false);
     prefs.putBool("dsReb", false);
     prefs.end();
   } else {
     prefs.begin("pzemkpi", false);
     prefs.putBool("dsOn", true);
     prefs.putBool("dsWant", false);
     prefs.putBool("dsReb", false);
     prefs.end();
   }
 
  publishStatus("ok", "sebelum deep sleep — mesin OFF", pzemOk);
  publishTelemetry();
  syncMqttHostFromWifi();
  saveIdentity();
  publishDeepSleepEvent("deep_sleep_enter", firstEnter ? nowEp : 0, 0);
   delay(300);
   mqtt.loop();
   delay(200);
 
   deepSleepHardwareStart();
   return true;  // tidak kembali
 }
 
 void enterDeepSleep(const char *reason, bool firstEnter) {
   tryEnterDeepSleepWithMqtt(reason, firstEnter);
 }
 
 void handleDeepSleepWake() {
   prefs.begin("pzemkpi", false);
   bool dsOn = prefs.getBool("dsOn", false);
   uint32_t fromEp = prefs.getULong("dsFrom", 0);
   uint32_t lastEp = prefs.getULong("dsLast", fromEp);
   prefs.end();
   if (!dsOn) return;
 
   // Tambah durasi sleep ke off_sec (~20 mnt)
   uint32_t nowEp = epochNowOr0();
   uint32_t dt = SLEEP_CHUNK_SEC;
   if (nowEp > 0 && lastEp > 0 && nowEp > lastEp) {
     dt = nowEp - lastEp;
     if (dt > 2 * SLEEP_CHUNK_SEC) dt = SLEEP_CHUNK_SEC;
   }
   offSec += dt;
   saveCounters(true);
 
   prefs.begin("pzemkpi", false);
   if (nowEp > 0) prefs.putULong("dsLast", nowEp);
   prefs.end();
 
   readPzem();
   OpStatus raw = classify(lastV, lastA, lastW, pzemOk);
   opStatus = raw;
   pendStatus = raw;
 
   if (raw != ST_OFF && pzemOk) {
     dsPendingExit = true;
     dsWakeWatch = false;
     prefs.begin("pzemkpi", false);
     prefs.putBool("dsOn", false);
     prefs.putBool("dsExit", true);
     prefs.putULong("dsFrom", fromEp);
     prefs.end();
     lcdPrint2("Wake: machine", "ON - connect");
   } else {
     // Masih OFF — WAJIB WiFi+MQTT dulu, kirim data, nunggu 5 mnt (jangan sleep langsung)
     dsWakeWatch = true;
     dsWatchStartMs = 0;
     lcdPrint2("Wake: OFF", "WiFi+MQTT dulu");
   }
 }
 
 void tryPublishDeepSleepExit() {
   if (!mqtt.connected()) return;
   prefs.begin("pzemkpi", true);
   bool need = prefs.getBool("dsExit", false) || dsPendingExit;
   bool dsTrack = prefs.getBool("dsOn", false) || prefs.getULong("dsFrom", 0) > 0;
   uint32_t fromEp = prefs.getULong("dsFrom", 0);
   prefs.end();
   bool machineOn = (opStatus != ST_OFF && pzemOk);
   // Mesin sudah ON tapi backend masih DEEPSLEEP → paksa exit
   if (!need && machineOn && (dsTrack || dsWakeWatch)) need = true;
   if (!need) return;
   uint32_t toEp = epochNowOr0();
   if (toEp == 0) toEp = fromEp + SLEEP_CHUNK_SEC;
   publishDeepSleepEvent("deep_sleep_exit", fromEp, toEp);
   prefs.begin("pzemkpi", false);
   prefs.putBool("dsExit", false);
   prefs.putBool("dsOn", false);
   prefs.putBool("dsWant", false);
   prefs.putBool("dsReb", false);
   prefs.remove("dsFrom");
   prefs.remove("dsLast");
   prefs.end();
   dsPendingExit = false;
   dsWakeWatch = false;
   dsWatchStartMs = 0;
 }
 
