rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 /** Dipanggil dari loop: dsWant (setelah reboot) + wake watch 5 mnt. */
 void serviceDeepSleepLogic() {
   if (mqtt.connected() && opStatus != ST_OFF && pzemOk) {
     tryPublishDeepSleepExit();
   }
   // Mesin nyala saat nunggu enter → batalkan
   if (opStatus != ST_OFF && pzemOk) {
     prefs.begin("pzemkpi", false);
     bool want = prefs.getBool("dsWant", false);
     prefs.end();
     if (want) {
       prefs.begin("pzemkpi", false);
       prefs.putBool("dsWant", false);
       prefs.putBool("dsReb", false);
       prefs.end();
     }
   }
 
   prefs.begin("pzemkpi", false);
   bool wantEnter = prefs.getBool("dsWant", false);
   prefs.end();
   if (wantEnter && opStatus == ST_OFF) {
     tryEnterDeepSleepWithMqtt("ds_want", true);
     return;
   }
 
   if (!dsWakeWatch) return;
 
   // Tunggu WiFi+MQTT sebelum mulai timer 5 mnt
   if (WiFi.status() != WL_CONNECTED || !mqtt.connected()) {
     lcdPrint2("Wake tunggu", "WiFi / MQTT");
     return;
   }
 
   if (dsWatchStartMs == 0) {
     dsWatchStartMs = millis();
     prefs.begin("pzemkpi", false);
     uint32_t fromEp = prefs.getULong("dsFrom", 0);
     prefs.end();
     publishDeepSleepEvent("deep_sleep_wake", fromEp, 0);
     publishStatus("ok", "wake check — mesin masih OFF", pzemOk);
     publishTelemetry();
     lcdPrint2("Wake: pantau", "5 mnt OFF?");
     Serial.println("[DS] wake MQTT OK — pantau 5 menit");
   }
 
   // Mesin nyala dalam jendela 5 mnt
   if (opStatus != ST_OFF && pzemOk) {
     dsPendingExit = true;
     prefs.begin("pzemkpi", false);
     prefs.putBool("dsOn", false);
     prefs.putBool("dsExit", true);
     prefs.end();
     tryPublishDeepSleepExit();
     dsWakeWatch = false;
     dsWatchStartMs = 0;
     offSinceMs = 0;
     return;
   }
 
   uint32_t elapsed = millis() - dsWatchStartMs;
   if (elapsed < DS_WAKE_WATCH_MS) {
     char line2[17];
     uint32_t left = (DS_WAKE_WATCH_MS - elapsed) / 1000;
     snprintf(line2, sizeof(line2), "OFF sisa %lum", (unsigned long)((left + 59) / 60));
     if ((millis() / 1000) % 10 == 0) lcdPrint2("Wake pantau", line2);
     return;
   }
 
   // Masih OFF setelah 5 mnt → kirim MQTT sleep lagi
   Serial.println("[DS] masih OFF 5 mnt → deep sleep 20 mnt");
   dsWakeWatch = false;
   dsWatchStartMs = 0;
   tryEnterDeepSleepWithMqtt("still_off_5m", false);
 }
 
 // ---------- MQTT status ----------
 void wifiMacString(char out[18]) {
   uint8_t mac[6];
   WiFi.macAddress(mac);
   snprintf(out, 18, "%02X:%02X:%02X:%02X:%02X:%02X",
            mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
 }

 void wifiMacLcdString(char out[17]) {
   uint8_t mac[6];
   WiFi.macAddress(mac);
   // LCD saja — 16 char: XX:XX:XXXX:XX:XX
   snprintf(out, 17, "%02X:%02X:%02X%02X:%02X:%02X",
            mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
 }

 void publishStatus(const char *state, const char *detail, bool sensorOk) {
   if (!mqtt.connected()) return;
   StaticJsonDocument<512> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["sensor"] = SENSOR_NAME;
   doc["state"] = state;
   doc["online"] = true;
   doc["wifi_ok"] = WiFi.status() == WL_CONNECTED;
   doc["mqtt_ok"] = true;
   doc["mqtt_service"] = mqttHost;
   doc["sensor_ok"] = sensorOk;
   doc["detail"] = detail;
   doc["rssi"] = WiFi.RSSI();
   char mac[18];
   wifiMacString(mac);
   doc["mac"] = mac;
   doc["wifi_ssid"] = wifiSsid;
   // IP tidak dikirim tiap status — hanya publishNetworkOnce() saat connect
   doc["uptime_sec"] = millis() / 1000;
   doc["fail_count"] = pzemFailCount;
   doc["run_sec"] = runSec;
   doc["loss_sec"] = lossSec;
   doc["off_sec"] = offSec;
   doc["op_status"] = statusStr(opStatus);
 
   char buf[512];
   size_t n = serializeJson(doc, buf);
   // Retain HANYA saat ganti state / event penting — heartbeat "ok" tanpa retain
   // (retain tiap 5 dtk membebani broker & memicu flapping di sisi subscribe)
   bool doRetain = (lastState != state) ||
                   (strcmp(state, "network") == 0) ||
                   (strcmp(state, "resync") == 0);
   if (mqtt.publish(topicStatus, (const uint8_t *)buf, n, doRetain) && lastState != state) {
     lastState = state;
   }
 }
 
 void publishNetworkOnce() {
   if (!mqtt.connected() || ipReportedOnce) return;
   if (WiFi.status() != WL_CONNECTED) return;
   StaticJsonDocument<384> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["sensor"] = SENSOR_NAME;
   doc["state"] = "network";
   doc["online"] = true;
   doc["wifi_ok"] = true;
   doc["mqtt_ok"] = true;
   doc["sensor_ok"] = pzemOk;
   doc["detail"] = "IP report once after MQTT connect";
   doc["rssi"] = WiFi.RSSI();
   doc["ip"] = WiFi.localIP().toString();
   char mac[18];
   wifiMacString(mac);
   doc["mac"] = mac;
   doc["wifi_ssid"] = wifiSsid;
   doc["mqtt_service"] = mqttHost;
   doc["mqtt_server"] = mqttHost;
   doc["ip_once"] = true;
   char buf[384];
   size_t n = serializeJson(doc, buf);
   if (mqtt.publish(topicStatus, (const uint8_t *)buf, n, true)) {
     ipReportedOnce = true;
   }
 }
 
 void publishAck(const char *command, bool ok) {
   StaticJsonDocument<192> doc;
   doc["device_uid"] = deviceUid;
   doc["command"] = command;
   doc["ok"] = ok;
   doc["current_threshold_a"] = currentThresholdA;
   doc["power_threshold_w"] = powerThresholdW;
   doc["run_sec"] = runSec;
   doc["loss_sec"] = lossSec;
   char buf[192];
   size_t n = serializeJson(doc, buf);
   mqtt.publish(topicAck, buf, n);
 }
 
 void publishConfigAck(const char *cmd) {
   StaticJsonDocument<384> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["command"] = cmd;
   doc["ok"] = true;
   doc["wifi_ssid"] = wifiSsid;
   doc["mqtt_host"] = mqttHost;
   doc["mqtt_service"] = mqttHost;
   doc["current_threshold_a"] = currentThresholdA;
   doc["off_current_a"] = offCurrentA;
   doc["power_threshold_w"] = powerThresholdW;
   doc["filter_aktif_ms"] = filterAktifMs;
   doc["filter_diam_ms"] = filterDiamMs;
   doc["lcd_auto_ms"] = lcdAutoMs;
   doc["machine_name"] = lcdName;
   doc["process_name"] = lcdProcess;
   doc["run_sec"] = runSec;
   doc["loss_sec"] = lossSec;
   doc["off_sec"] = offSec;
   char buf[384];
   size_t n = serializeJson(doc, buf);
   mqtt.publish(topicAck, buf, n);
 }

 void publishLoginSystemFeedback() {
   if (!mqtt.connected()) return;
   StaticJsonDocument<320> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["command"] = "login_system_feedback";
   doc["login_required"] = loginSystemOn;
   doc["operator_logged_in"] = operatorLoggedIn;
   const char *status = loginSystemOn ? "ACTIVATED" : "DEACTIVATED";
   doc["status"] = status;
   char msg[72];
   snprintf(msg, sizeof(msg), "System Login UID %s %s", deviceUid, status);
   doc["message"] = msg;
   doc["ok"] = true;
   char buf[320];
   size_t n = serializeJson(doc, buf);
   mqtt.publish(topicAck, buf, n);
 }

 void publishWifiScanAck() {
   if (WiFi.status() != WL_CONNECTED) {
     publishAck("wifi_scan", false);
     return;
   }
   flashLcdMsg("Scan WiFi ...", " ");
   int n = WiFi.scanNetworks(false, true);
   if (n < 0) {
     publishAck("wifi_scan", false);
     return;
   }
 
   StaticJsonDocument<3072> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["command"] = "wifi_scan";
   doc["ok"] = true;
   JsonArray arr = doc.createNestedArray("wifi_list");
   int cap = n > 12 ? 12 : n;
   for (int i = 0; i < cap; i++) {
     JsonObject ap = arr.createNestedObject();
     ap["ssid"] = WiFi.SSID(i);
     ap["rssi"] = WiFi.RSSI(i);
     ap["secure"] = WiFi.encryptionType(i) != WIFI_AUTH_OPEN;
     ap["channel"] = 0;
   }
   char buf[3072];
   size_t len = serializeJson(doc, buf);
   mqtt.publish(topicAck, buf, len);
   WiFi.scanDelete();
   flashLcdMsg("Scan WiFi OK", " ");
 }

 /**
  * Terapkan snapshot backend (topic desired retained + cmd desired_state).
  * revision monoton → ESP offline tetap dapat perubahan terakhir saat online.
  */
 bool applyDesiredState(JsonDocument &doc) {
   const char *tgt = doc["target_uid"] | "";
   if (tgt[0] && strcmp(tgt, deviceUid) != 0) return false;

