rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
   uint32_t rev = doc["revision"] | 0;
   if (rev > 0 && rev <= lastDesiredRevision) return false;

   bool loginChanged = false;
   const char *code = doc["machine_code"] | "";
   const char *uid = doc["target_uid"] | "";
   if (code[0] || uid[0]) applyIdentity(code, uid);

   if (doc.containsKey("machine_name")) {
     const char *n = doc["machine_name"] | "";
     strncpy(lcdName, n, sizeof(lcdName) - 1);
     lcdName[sizeof(lcdName) - 1] = '\0';
   }
   if (doc.containsKey("process_name")) {
     const char *p = doc["process_name"] | "";
     strncpy(lcdProcess, p, sizeof(lcdProcess) - 1);
     lcdProcess[sizeof(lcdProcess) - 1] = '\0';
   }
   if (doc.containsKey("branch")) {
     const char *v = doc["branch"] | "";
     strncpy(lcdBranch, v, sizeof(lcdBranch) - 1);
     lcdBranch[sizeof(lcdBranch) - 1] = '\0';
   }
   if (doc.containsKey("line_name")) {
     const char *v = doc["line_name"] | "";
     strncpy(lcdLine, v, sizeof(lcdLine) - 1);
     lcdLine[sizeof(lcdLine) - 1] = '\0';
   }
   if (doc.containsKey("location_note")) {
     const char *v = doc["location_note"] | "";
     strncpy(lcdLocation, v, sizeof(lcdLocation) - 1);
     lcdLocation[sizeof(lcdLocation) - 1] = '\0';
   }
   if (doc.containsKey("garment_style")) {
     const char *v = doc["garment_style"] | "";
     strncpy(lcdGarmentStyle, v, sizeof(lcdGarmentStyle) - 1);
     lcdGarmentStyle[sizeof(lcdGarmentStyle) - 1] = '\0';
   }
   if (doc.containsKey("current_threshold_a")) {
     float v = doc["current_threshold_a"].as<float>();
     if (v >= 0.005f && v <= 50.0f) currentThresholdA = v;
   }
   if (doc.containsKey("off_current_a")) {
     float v = doc["off_current_a"].as<float>();
     if (v >= 0.0f && v <= 5.0f) offCurrentA = v;
   }
   if (doc.containsKey("power_threshold_w")) {
     float v = doc["power_threshold_w"].as<float>();
     if (v >= 0.0f && v <= 5000.0f) powerThresholdW = v;
   }
   if (doc.containsKey("lcd_auto_ms")) {
     uint32_t v = doc["lcd_auto_ms"].as<uint32_t>();
     if (v >= 4000 && v <= 60000) lcdAutoMs = v;
   }
   if (doc.containsKey("kpi_source")) {
     const char *src = doc["kpi_source"] | "esp";
     kpiFromBackend = (strcmp(src, "telemetry") == 0 || strcmp(src, "backend") == 0);
   }
   if (doc.containsKey("login_required")) {
     bool en = doc["login_required"].as<bool>();
     if (en != loginSystemOn) {
       loginChanged = true;
       loginSystemOn = en;
       if (!loginSystemOn) {
         operatorLoggedIn = true;
         int ymd = wibYmdNow();
         loginWibYmd = ymd > 0 ? ymd : 0;
       } else {
         clearOperatorLogin("desired_state");
       }
     }
   }
   if (doc.containsKey("logged_in")) {
     bool ok = doc["logged_in"].as<bool>();
     if (!loginSystemOn) ok = true;
     setOperatorLoggedIn(ok, false);
   }
   if (doc.containsKey("operator_name")) {
     const char *op = doc["operator_name"] | "";
     if (op[0]) {
       strncpy(lcdOperator, op, sizeof(lcdOperator) - 1);
       lcdOperator[sizeof(lcdOperator) - 1] = '\0';
     } else if (doc.containsKey("logged_in") && !doc["logged_in"].as<bool>()) {
       lcdOperator[0] = '\0';
     }
   }

   if (rev > 0) lastDesiredRevision = rev;
   saveCalibration();
   saveLoginState();
   renderLcd();

   StaticJsonDocument<256> ack;
   ack["device_uid"] = deviceUid;
   ack["machine_code"] = machineCode;
   ack["command"] = "desired_state";
   ack["ok"] = true;
   ack["revision"] = lastDesiredRevision;
   ack["login_required"] = loginSystemOn;
   ack["logged_in"] = operatorLoggedIn;
   char buf[256];
   size_t n = serializeJson(ack, buf);
   mqtt.publish(topicAck, buf, n);
   if (loginChanged) publishLoginSystemFeedback();
   return true;
 }

 void onMqttMessage(char *topic, byte *payload, unsigned int length) {
   StaticJsonDocument<1536> doc;
   if (deserializeJson(doc, payload, length)) return;
   const char *cmd = doc["command"] | "";

   if (strcmp(cmd, "desired_state") == 0) {
     applyDesiredState(doc);
     return;
   }
 
   if (strcmp(cmd, "wifi_scan") == 0) {
     publishWifiScanAck();
   } else if (strcmp(cmd, "set_identity") == 0) {
     const char *code = doc["machine_code"] | "";
     const char *uid = doc["device_uid"] | "";
     applyIdentity(code, uid);
 
     if (doc.containsKey("machine_name")) {
       const char *n = doc["machine_name"] | "";
       strncpy(lcdName, n, sizeof(lcdName) - 1);
       lcdName[sizeof(lcdName) - 1] = '\0';
     }
     if (doc.containsKey("process_name")) {
       const char *p = doc["process_name"] | "";
       strncpy(lcdProcess, p, sizeof(lcdProcess) - 1);
       lcdProcess[sizeof(lcdProcess) - 1] = '\0';
     }
     if (doc.containsKey("current_threshold_a")) {
       float v = doc["current_threshold_a"].as<float>();
       if (v >= 0.005f && v <= 50.0f) currentThresholdA = v;
     }
     if (doc.containsKey("off_current_a")) {
       float v = doc["off_current_a"].as<float>();
       if (v >= 0.0f && v <= 5.0f) offCurrentA = v;
     }
     if (doc.containsKey("power_threshold_w")) {
       float v = doc["power_threshold_w"].as<float>();
       if (v >= 0.0f && v <= 5000.0f) powerThresholdW = v;
     }
     if (doc.containsKey("filter_aktif_ms")) {
       uint32_t v = doc["filter_aktif_ms"].as<uint32_t>();
       if (v >= 50 && v <= 60000) filterAktifMs = v;
     }
     if (doc.containsKey("filter_diam_ms")) {
       uint32_t v = doc["filter_diam_ms"].as<uint32_t>();
       if (v >= 50 && v <= 60000) filterDiamMs = v;
     }
     if (doc.containsKey("lcd_auto_ms")) {
       uint32_t v = doc["lcd_auto_ms"].as<uint32_t>();
       if (v >= 4000 && v <= 60000) lcdAutoMs = v;
     }
     if (doc.containsKey("kpi_source")) {
       const char *src = doc["kpi_source"] | "esp";
       kpiFromBackend = (strcmp(src, "telemetry") == 0 || strcmp(src, "backend") == 0);
     }
     saveCalibration();
     renderLcd();
     publishConfigAck(cmd);
   } else if (strcmp(cmd, "set_network") == 0) {
     bool dirty = false;
     if (doc.containsKey("wifi_ssid")) {
       const char *s = doc["wifi_ssid"] | "";
       if (s[0] && strcmp(s, wifiSsid) != 0) {
         strncpy(wifiSsid, s, sizeof(wifiSsid) - 1);
         wifiSsid[sizeof(wifiSsid) - 1] = 0;
         dirty = true;
         wifiCredsDirty = true;
       }
     }
     if (doc.containsKey("wifi_pass")) {
       const char *p = doc["wifi_pass"] | "";
       strncpy(wifiPass, p, sizeof(wifiPass) - 1);
       wifiPass[sizeof(wifiPass) - 1] = 0;
       dirty = true;
       wifiCredsDirty = true;
     }
     if (doc.containsKey("mqtt_host")) {
       const char *h = doc["mqtt_host"] | "";
       if (h[0] && strcmp(h, mqttHost) != 0) {
         strncpy(mqttHost, h, sizeof(mqttHost) - 1);
         mqttHost[sizeof(mqttHost) - 1] = 0;
         dirty = true;
         mqtt.setServer(mqttHost, MQTT_PORT);
         mqttNeedsReconnect = true;
       }
     }
     if (dirty) saveIdentity();
     publishConfigAck(cmd);
   } else if (strcmp(cmd, "set_calibration") == 0) {
     if (doc.containsKey("current_threshold_a")) {
       float v = doc["current_threshold_a"].as<float>();
       if (v >= 0.005f && v <= 50.0f) currentThresholdA = v;
     }
     if (doc.containsKey("off_current_a")) {
       float v = doc["off_current_a"].as<float>();
       if (v >= 0.0f && v <= 5.0f) offCurrentA = v;
     }
     if (doc.containsKey("power_threshold_w")) {
       float v = doc["power_threshold_w"].as<float>();
       if (v >= 0.0f && v <= 5000.0f) powerThresholdW = v;
     }
     if (doc.containsKey("voltage_on_v")) {
       float v = doc["voltage_on_v"].as<float>();
       if (v >= 50.0f && v <= 300.0f) voltageOnV = v;
     }
     if (doc.containsKey("filter_aktif_ms")) {
       uint32_t v = doc["filter_aktif_ms"].as<uint32_t>();
       if (v >= 50 && v <= 60000) filterAktifMs = v;
     }
     if (doc.containsKey("filter_diam_ms")) {
       uint32_t v = doc["filter_diam_ms"].as<uint32_t>();
       if (v >= 50 && v <= 60000) filterDiamMs = v;
     }
     saveCalibration();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "set_display") == 0) {
     if (doc.containsKey("machine_name")) {
       const char *n = doc["machine_name"] | "";
       strncpy(lcdName, n, sizeof(lcdName) - 1);
       lcdName[sizeof(lcdName) - 1] = '\0';
     }
     if (doc.containsKey("process_name")) {
       const char *p = doc["process_name"] | "";
       strncpy(lcdProcess, p, sizeof(lcdProcess) - 1);
       lcdProcess[sizeof(lcdProcess) - 1] = '\0';
     }
     if (doc.containsKey("operator_name")) {
       const char *op = doc["operator_name"] | "";
       if (op[0]) {
         strncpy(lcdOperator, op, sizeof(lcdOperator) - 1);
         lcdOperator[sizeof(lcdOperator) - 1] = '\0';
       }
     }
     if (doc.containsKey("lcd_auto_ms")) {
       uint32_t v = doc["lcd_auto_ms"].as<uint32_t>();
       if (v >= 4000 && v <= 60000) lcdAutoMs = v;
     }
     if (doc.containsKey("lcd_page")) {
       int p = doc["lcd_page"].as<int>();
       if (p >= 0 && p < (int)lcdSlideCount()) {
         lcdPage = (LcdPage)p;
         lcdScrollPos = 0;
         lcdManualHold = true;
         lastPageAutoMs = millis();
       }
     }
     saveCalibration();
     renderLcd();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "sync_kpi") == 0) {
     const char *src = doc["source"] | "esp";
     if (strcmp(src, "backend") == 0) {
       kpiFromBackend = true;
       if (doc.containsKey("run_sec")) runSec = doc["run_sec"].as<uint32_t>();
       if (doc.containsKey("loss_sec")) lossSec = doc["loss_sec"].as<uint32_t>();
       if (doc.containsKey("off_sec")) offSec = doc["off_sec"].as<uint32_t>();
       saveCounters(true);
     } else {
       kpiFromBackend = false;
     }
     saveCalibration();
     renderLcd();
     publishAck(cmd, true);
     publishTelemetry();
   } else if (strcmp(cmd, "reset_day") == 0) {
     const char *target = doc["sensor"] | "";
     if (target[0] != '\0' && strcmp(target, SENSOR_NAME) != 0) return;
     resetDayCounters("mqtt");
     publishAck(cmd, true);
     publishTelemetry();
     publishStatus("ok", "day counters reset via MQTT", pzemOk);
   } else if (strcmp(cmd, "ping") == 0) {
     publishAck(cmd, true);
   } else if (strcmp(cmd, "lcd_page") == 0) {
     lcdPage = (LcdPage)((lcdPage + 1) % lcdSlideCount());
     lcdScrollPos = 0;
     lcdManualHold = true;
     lastPageAutoMs = millis();
     renderLcd();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "get_config") == 0) {
     publishConfigAck(cmd);
   } else if (strcmp(cmd, "get_history") == 0 || strcmp(cmd, "sync_history") == 0) {
     publishAllDailyHistory();
   } else if (strcmp(cmd, "clear_history") == 0) {
     dailyHistoryCount = 0;
     memset(dailyHistory, 0, sizeof(dailyHistory));
     saveDailyHistory();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "login_success") == 0) {
     setOperatorLoggedIn(true, true);
     const char *msg = doc["lcd_message"] | "Login Sukses";
     snprintf(lcdLoginLine1, sizeof(lcdLoginLine1), "%.16s", msg[0] ? msg : "Login Sukses");
     const char *op = doc["operator_name"] | "";
     if (op[0]) {
       snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "%.16s", op);
       strncpy(lcdOperator, op, sizeof(lcdOperator) - 1);
       lcdOperator[sizeof(lcdOperator) - 1] = 0;
     } else {
       const char *st = doc["garment_style"] | "";
       const char *nik = doc["operator_nik"] | "";
       snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "%.16s", st[0] ? st : (nik[0] ? nik : " "));
     }
     loginFlashUntilMs = millis() + 5000;
     renderLcd();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "data_saved") == 0) {
     // Indikator dari Control Machine / sync dashboard
     const char *msg = doc["message"] | "Data Tersimpan";
     char line2[17];
     const char *br = doc["branch"] | "";
     const char *ln = doc["line_name"] | "";
     if (br[0] || ln[0]) {
       snprintf(line2, sizeof(line2), "%.7s %.7s", br[0] ? br : "-", ln[0] ? ln : "-");
     } else {
       snprintf(line2, sizeof(line2), "UID %s", deviceUid);
     }
     flashLcdMsg(msg[0] ? msg : "Data Tersimpan", line2);
     publishAck(cmd, true);
   } else if (strcmp(cmd, "set_login_system") == 0) {
     // login_required / enabled: true = System Login ON (wajib), false = OFF
     bool en = loginSystemOn;
     if (doc.containsKey("login_required")) en = doc["login_required"].as<bool>();
     else if (doc.containsKey("enabled")) en = doc["enabled"].as<bool>();
     bool changed = (en != loginSystemOn);
     loginSystemOn = en;
     if (!loginSystemOn) {
       operatorLoggedIn = true;
       int ymd = wibYmdNow();
       loginWibYmd = ymd > 0 ? ymd : 0;
     } else {
       clearOperatorLogin("login_system_on");
     }
     saveLoginState();
     const char *msg = doc["message"] | "";
     if (!msg[0]) {
       msg = loginSystemOn ? "System Login Di Aktifkan" : "System Login Non-Aktifkan";
     }
     flashLcdScrollMsg(msg, " ");
     if (changed) publishLoginSystemFeedback();
     else publishAck(cmd, true);
   } else if (strcmp(cmd, "login_status") == 0) {
     // Sinkron dari backend saat boot/resync
     if (doc.containsKey("login_required")) {
       loginSystemOn = doc["login_required"].as<bool>();
     }
     bool ok = doc["logged_in"] | false;
     if (!loginSystemOn) {
       ok = true;  // OFF → jangan paksa slide "OPERATOR BELUM"
     }
     setOperatorLoggedIn(ok, false);
     saveLoginState();
     if (ok) {
       const char *op = doc["operator_name"] | "";
       if (op[0]) {
         snprintf(lcdLoginLine2, sizeof(lcdLoginLine2), "%.16s", op);
         strncpy(lcdOperator, op, sizeof(lcdOperator) - 1);
         lcdOperator[sizeof(lcdOperator) - 1] = 0;
       }
     }
     renderLcd();
     publishAck(cmd, true);
   } else if (strcmp(cmd, "reboot") == 0) {
     publishAck(cmd, true);
     delay(200);
     ESP.restart();
   }
 }
 
 /**
  * Optimasi WiFi STA ESP32-C6 SuperMini (sinyal jauh + noise industri):
  * 1. PS_NONE — radio 100% aktif (anti packet loss / latency spike).
  * 2. TX max 21 dBm — jangkauan uplink lebih jauh.
  * 3. HT20 — sensitivitas RX lebih baik (+~3 dB) vs HT40 di lingkungan noise.
  * 4. 11b/g/n/ax — HE20 bila AP Wi‑Fi 6, fallback mulus.
  * 5. Country ID ch 1–13 — scan channel lokal penuh.
  * 6. ALL_CHANNEL_SCAN + CONNECT_AP_BY_SIGNAL — pilih BSSID RSSI terkuat.
  * 7. failure_retry_cnt tinggi — tahan flapping auth di edge coverage.
  * 8. Watchdog RSSI (wifiWatchRssiAndRoam) — roam ke AP lebih kuat jika sinyal jelek.
  */
 void applyWifiStaOptimizations() {
   WiFi.persistent(false);
   WiFi.setAutoReconnect(true);
   WiFi.setSleep(false);
   esp_wifi_set_ps(WIFI_PS_NONE);
 
   wifi_country_t country;
   memset(&country, 0, sizeof(country));
   strcpy(country.cc, "ID");
   country.schan = 1;
   country.nchan = 13;
   country.max_tx_power = 20;
   country.policy = WIFI_COUNTRY_POLICY_AUTO;
   esp_wifi_set_country(&country);
 
   esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
 
 #ifdef WIFI_PROTOCOL_11AX
   esp_wifi_set_protocol(
       WIFI_IF_STA,
       WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX);
 #else
   esp_wifi_set_protocol(
       WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
 #endif
 
   // 0.25 dBm units; 84 = 21.0 dBm
   esp_wifi_set_max_tx_power(84);
 
   // ponytail: STA inactive lebih longgar agar AP tidak drop cepat saat noise spike
   esp_wifi_set_inactive_time(WIFI_IF_STA, 30);
 
   wifi_config_t conf;
   if (esp_wifi_get_config(WIFI_IF_STA, &conf) == ESP_OK) {
     conf.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
     conf.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
     conf.sta.threshold.rssi = -127;  // jangan tolak AP lemah saat connect awal
     conf.sta.threshold.authmode = WIFI_AUTH_OPEN;
     conf.sta.listen_interval = 3;    // beacon listen lebih sering (anti miss AP)
 #if ESP_IDF_VERSION_MAJOR >= 4
     conf.sta.failure_retry_cnt = 8;
 #endif
 #ifdef CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
     conf.sta.pmf_cfg.capable = true;
     conf.sta.pmf_cfg.required = false;
 #endif
     esp_wifi_set_config(WIFI_IF_STA, &conf);
   }
 }
 
 void wifiCopyCreds(const char *ssid, const char *pass) {
   strncpy(wifiSsid, ssid ? ssid : "", sizeof(wifiSsid) - 1);
   strncpy(wifiPass, pass ? pass : "", sizeof(wifiPass) - 1);
   wifiSsid[sizeof(wifiSsid) - 1] = 0;
   wifiPass[sizeof(wifiPass) - 1] = 0;
   updateMqttHostForSsid(wifiSsid);
 }
 
 void wifiLoadPrimary() {
   wifiPhase = WP_PRIMARY;
   wifiCopyCreds(DEFAULT_WIFI_SSID, DEFAULT_WIFI_PASS);
 }
 
