rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
 void wifiLoadFallback() {
   wifiPhase = WP_FALLBACK;
   wifiCopyCreds(DEFAULT_WIFI_SSID_FALLBACK, DEFAULT_WIFI_PASS_FALLBACK);
 }
 
 void wifiBeginCurrent() {
   saveCounters(true);
   WiFi.disconnect(false);
   delay(30);
   updateMqttHostForSsid(wifiSsid);
   applyWifiStaOptimizations();
   WiFi.setHostname(mqttClientId);
   WiFi.begin(wifiSsid, wifiPass);
 
   // Re-apply setelah begin (IDF kadang reset sebagian config)
   wifi_config_t conf;
   if (esp_wifi_get_config(WIFI_IF_STA, &conf) == ESP_OK) {
     conf.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
     conf.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
     conf.sta.threshold.rssi = -127;
 #if ESP_IDF_VERSION_MAJOR >= 4
     conf.sta.failure_retry_cnt = 8;
 #endif
     esp_wifi_set_config(WIFI_IF_STA, &conf);
   }
   esp_wifi_set_ps(WIFI_PS_NONE);
   esp_wifi_set_max_tx_power(84);
   WiFi.setSleep(false);
 
   wifiTryStartMs = millis();
   lastWifiAttemptMs = wifiTryStartMs;
   wifiRssiBadHits = 0;
   lastRssiCheckMs = millis();
 }
 
 /** Scan SSID yang sama; reconnect ke BSSID yang ≥ improveDb lebih kuat. */
 bool wifiRoamToStrongerBssid() {
   if (WiFi.status() != WL_CONNECTED) return false;
   uint32_t now = millis();
   if (lastWifiRoamMs != 0 && (now - lastWifiRoamMs) < WIFI_ROAM_COOLDOWN_MS) return false;
   // Jangan roam saat MQTT baru stabil — scan blocking mematikan keepalive
   if (mqtt.connected() && mqttConnectedAtMs != 0 &&
       (now - mqttConnectedAtMs) < MQTT_STABLE_BEFORE_ROAM_MS) {
     return false;
   }
 
   String curSsid = WiFi.SSID();
   if (curSsid.length() == 0) return false;
   int curRssi = WiFi.RSSI();
   uint8_t curBssid[6];
   memcpy(curBssid, WiFi.BSSID(), 6);
 
   // Service MQTT dulu sebelum scan blocking
   if (mqtt.connected()) mqtt.loop();
 
   int n = WiFi.scanNetworks(/*async=*/false, /*hidden=*/true);
   if (n <= 0) {
     WiFi.scanDelete();
     if (mqtt.connected()) mqtt.loop();
     return false;
   }
 
   int bestIdx = -1;
   int32_t bestRssi = curRssi + WIFI_RSSI_ROAM_IMPROVE_DB;
   for (int i = 0; i < n; i++) {
     if (!curSsid.equals(WiFi.SSID(i))) continue;
     uint8_t *bss = WiFi.BSSID(i);
     if (!bss) continue;
     if (memcmp(bss, curBssid, 6) == 0) continue;
     int32_t r = WiFi.RSSI(i);
     if (r > bestRssi) {
       bestRssi = r;
       bestIdx = i;
     }
   }
 
   if (bestIdx < 0) {
     WiFi.scanDelete();
     if (mqtt.connected()) mqtt.loop();
     return false;
   }
 
   uint8_t bestBssid[6];
   memcpy(bestBssid, WiFi.BSSID(bestIdx), 6);
   int32_t channel = WiFi.channel(bestIdx);
   WiFi.scanDelete();

   Serial.printf("[WiFi] roam RSSI %d→%d dBm BSSID %02X:%02X:%02X:%02X:%02X:%02X\n",
                 curRssi, (int)bestRssi,
                 bestBssid[0], bestBssid[1], bestBssid[2],
                 bestBssid[3], bestBssid[4], bestBssid[5]);
 
   saveCounters(true);
   if (mqtt.connected()) {
     mqtt.disconnect();
     mqttWasOk = false;
   }
   ipReportedOnce = false;
 
   WiFi.disconnect(false);
   delay(40);
   applyWifiStaOptimizations();
   WiFi.setHostname(mqttClientId);
   WiFi.begin(wifiSsid, wifiPass, channel, bestBssid, true);
   esp_wifi_set_ps(WIFI_PS_NONE);
   esp_wifi_set_max_tx_power(84);
   wifiRssiBadHits = 0;
   lastRssiCheckMs = millis();
   lastWifiRoamMs = millis();
   return true;
 }
 
 /** Saat connected: pantau RSSI lemah → roam; sinyal bagus → reset hit. */
 void wifiWatchRssiAndRoam() {
   uint32_t now = millis();
   if (now - lastRssiCheckMs < WIFI_RSSI_CHECK_MS) return;
   lastRssiCheckMs = now;
 
   int rssi = WiFi.RSSI();
   if (rssi > WIFI_RSSI_ROAM_DBM) {
     wifiRssiBadHits = 0;
     // jaga radio tetap full (beberapa AP/PS bisa nyalakan sleep lagi)
     esp_wifi_set_ps(WIFI_PS_NONE);
     WiFi.setSleep(false);
     return;
   }
 
   wifiRssiBadHits++;
   Serial.printf("[WiFi] RSSI lemah %d dBm hit=%u/%u\n",
                 rssi, wifiRssiBadHits, WIFI_RSSI_BAD_HITS);
   if (wifiRssiBadHits < WIFI_RSSI_BAD_HITS) return;
   wifiRssiBadHits = 0;
   wifiRoamToStrongerBssid();
 }
 
 void wifiResetCycle() {
   wifiAllFailed = false;
   wifiDownSinceMs = millis();
   wifiLoadPrimary();
   wifiBeginCurrent();
 }
 
 bool ensureWifi() {
   uint32_t now = millis();
 
   if (WiFi.status() == WL_CONNECTED) {
     if (!wifiWasOk) {
       wifiWasOk = true;
       wifiAllFailed = false;
       wifiDownSinceMs = 0;
      wifiRssiBadHits = 0;
      syncMqttHostFromWifi();
      configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVER);
       saveIdentity();
       Serial.printf("[WiFi] OK ssid=%s ip=%s mqtt=%s\n",
                     wifiSsid, WiFi.localIP().toString().c_str(), mqttHost);
     }
     wifiWatchRssiAndRoam();
     return true;
   }
 
   if (wifiWasOk) {
     saveCounters(true);
     wifiWasOk = false;
     mqttWasOk = false;
     ntpOk = false;
     wifiRssiBadHits = 0;
     if (mqtt.connected()) mqtt.disconnect();
     ipReportedOnce = false;
     wifiDownSinceMs = now;
     wifiAllFailed = false;
     wifiLoadPrimary();  // putus → balik ke Tracked (9) dulu
     wifiBeginCurrent();
     return false;
   }
 
   if (wifiDownSinceMs == 0) {
     wifiResetCycle();
     return false;
   }
 
   uint32_t downFor = now - wifiDownSinceMs;
 
   if (wifiPhase == WP_PRIMARY) {
     wifiAllFailed = false;
     if (downFor >= WIFI_PRIMARY_ONLY_MS) {
       Serial.println("[WiFi] primary gagal ≥30 mnt → cadangan GM3_DuckDown");
       wifiLoadFallback();
       wifiBeginCurrent();
       return false;
     }
     if (now - wifiTryStartMs >= WIFI_RETRY_MS) {
       wifiLoadPrimary();
       wifiBeginCurrent();
     }
     return false;
   }
 
   // WP_FALLBACK — satu opsi cadangan
   if (downFor >= WIFI_PRIMARY_ONLY_MS + WIFI_FALLBACK_RETRY_MS) {
     // cadangan juga gagal lama → balik primary, timer 30 mnt ulang
     Serial.println("[WiFi] cadangan gagal → ulang Tracked (9)");
     wifiAllFailed = true;
     wifiDownSinceMs = now;
     wifiLoadPrimary();
     wifiBeginCurrent();
     return false;
   }
 
   if (now - wifiTryStartMs >= WIFI_RETRY_MS) {
     wifiLoadFallback();
     wifiBeginCurrent();
   }
   // LCD "GAGAL" setelah >1 mnt di fase cadangan masih putus
   wifiAllFailed = (downFor > WIFI_PRIMARY_ONLY_MS + 60000UL);
   return false;
 }
 
 bool ensureMqtt() {
   if (mqtt.connected()) {
     if (!mqttWasOk) {
       mqttWasOk = true;
       mqttBackoffMs = MQTT_RETRY_MS;
       mqttConnectedAtMs = millis();
       ipReportedOnce = false;
       saveCounters(true);
       publishNetworkOnce();
       publishTelemetry();
       // retain sekali saat nyambung — timpa LWT
       publishStatus("resync", "MQTT reconnect — sync Run/Loss dari ESP", pzemOk);
       tryPublishDeepSleepExit();
     }
     return true;
   }
   if (WiFi.status() != WL_CONNECTED) return false;
   if (mqttWasOk) {
     saveCounters(true);
     mqttWasOk = false;
     Serial.println("[MQTT] disconnected — will reconnect with backoff");
   }
 
