rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
   uint32_t now = millis();
   if (now - lastMqttAttemptMs < mqttBackoffMs) return false;
   lastMqttAttemptMs = now;
   mqttFailCount++;
 
   // Pastikan socket lama bersih sebelum connect ulang
   mqtt.disconnect();
   delay(50);
   mqtt.setServer(mqttHost, MQTT_PORT);
   mqtt.setKeepAlive(MQTT_KEEPALIVE_SEC);
   mqtt.setSocketTimeout(MQTT_SOCKET_TIMEOUT_SEC);
 
   // Boot pertama: clean session. Reconnect: keep session (lebih ringan di broker)
   bool cleanSession = !mqttEverConnected;
   Serial.printf("[MQTT] connect %s:%u client=%s clean=%d backoff=%lums\n",
                 mqttHost, MQTT_PORT, mqttClientId, cleanSession ? 1 : 0,
                 (unsigned long)mqttBackoffMs);
 
   bool ok = mqtt.connect(mqttClientId, nullptr, nullptr, topicStatus, 1, true, willPayload,
                          cleanSession);
   if (ok) {
     mqttEverConnected = true;
     mqttBackoffMs = MQTT_RETRY_MS;
     mqttConnectedAtMs = millis();
     ipReportedOnce = false;
     resubscribeMqtt();
     mqttWasOk = true;
     saveCounters(true);
     publishNetworkOnce();
     publishAck("boot", true);
     publishTelemetry();
     publishStatus("resync", "MQTT connected — sync Run/Loss dari ESP", pzemOk);
     // History 7 hari: hanya boot pertama / setelah lama offline — jangan tiap reconnect
     if (cleanSession) {
       publishAllDailyHistory();
     }
     tryPublishDeepSleepExit();
     Serial.println("[MQTT] connected OK");
     return true;
   }
 
   Serial.printf("[MQTT] connect gagal state=%d\n", mqtt.state());
   // Exponential backoff: 5s → 10s → … → 120s (hindari ban broker)
   if (mqttBackoffMs < MQTT_RETRY_MAX_MS) {
     uint32_t next = mqttBackoffMs * 2;
     mqttBackoffMs = next > MQTT_RETRY_MAX_MS ? MQTT_RETRY_MAX_MS : next;
   }
   return false;
 }
 
 OpStatus classify(float v, float a, float w, bool ok) {
   (void)v;  // ponytail: tegangan tidak menentukan status; hanya arus (abaikan power fallback)
   if (!ok) return ST_OFF;
 
   // A < off → Mati; off ≤ A < thr → Idle; A ≥ thr → Running
   float offA = offCurrentA;
   if (offA < 0.0f) offA = 0.01f;
   if (a < offA) return ST_OFF;
 
   float thrA = currentThresholdA;
   if (thrA <= offA) thrA = offA + 0.001f;
 
   bool running = (a >= thrA);
   (void)w; // power tidak dipakai untuk status
   return running ? ST_RUNNING : ST_IDLE;
 }
 
 void tickTimers() {
   uint32_t now = millis();
   if (lastTickMs == 0) {
     lastTickMs = now;
     return;
   }
   uint32_t dt = (now - lastTickMs) / 1000;
   if (dt == 0) return;
   lastTickMs += dt * 1000;
 
   // Mode backend: angka Run/Loss dari sync MQTT, jangan naikkan lokal
   if (kpiFromBackend) return;
 
   switch (opStatus) {
     case ST_RUNNING: runSec += dt; break;
     case ST_IDLE: lossSec += dt; break;
     default: offSec += dt; break;
   }
   markCountersDirty();
 }
 
 void checkWibMidnight() {
   int ymd = wibYmdNow();
   if (ymd < 0) return;
   ntpOk = true;
 
   // Login NVS dari hari lain → anggap belum login
   if (operatorLoggedIn && loginWibYmd > 0 && loginWibYmd != ymd) {
     clearOperatorLogin("ymd_mismatch");
   }
   // Login tanpa ymd (NTP baru OK) → ikat ke hari ini
   if (operatorLoggedIn && loginWibYmd <= 0) {
     loginWibYmd = ymd;
     saveLoginState();
   }
 
   if (lastWibYmd < 0) {
     // Pertama kali NTP OK: jika counter NVS dari hari lain, reset
     lastWibYmd = ymd;
     if (runSec + lossSec + offSec > 0) {
       // ponytail: tanpa ymd tersimpan, anggap counter milik hari ini (lanjut)
       saveCounters(true);
     } else {
       saveCounters(true);
     }
     return;
   }
    if (ymd != lastWibYmd) {
      // ===== JAM 00:00 WIB PERGANTIAN HARI =====
      // 1. Simpan snapshot data hari yang berakhir (lastWibYmd) ke memori 7 hari
      recordDailySnapshot(lastWibYmd, runSec, lossSec, offSec);
 
      // 2. Publish status & telemetry
      publishStatus("day_cut", "WIB midnight / hari baru - snapshot 7 hari tersimpan & reset counter", pzemOk);
      lastWibYmd = ymd;
      resetDayCounters("wib_midnight");
      if (mqtt.connected()) {
        publishTelemetry();
        publishAllDailyHistory();
      }
    }
 }
 
 void readPzem() {
   float v = pzem.voltage();
   bool ok = !isnan(v);
   float a = 0, w = 0, e = 0, f = 0, pf = 0;
   if (!ok) {
     pzemFailCount++;
     pzemOk = false;
     if (pzemFailCount == 1 || (pzemFailCount % 10) == 0) {
       publishStatus("sensor_fail", "PZEM NaN — cek TX/RX/GND/L-N AC", false);
     }
   } else {
     if (!pzemOk) publishStatus("sensor_ok", "PZEM terbaca", true);
     pzemOk = true;
     pzemFailCount = 0;
     a = pzem.current();
     w = pzem.power();
     e = pzem.energy();
     f = pzem.frequency();
     pf = pzem.pf();
     if (isnan(a)) a = 0;
     if (isnan(w)) w = 0;
     if (isnan(e)) e = 0;
     if (isnan(f)) f = 0;
     if (isnan(pf)) pf = 0;
   }
   lastV = ok ? v : 0;
   lastA = a;
   lastW = w;
   lastE = e;
   lastHz = f;
   lastPf = pf;
   applyStatusFilter(classify(lastV, lastA, lastW, ok));
 }
 
 void publishTelemetry() {
   if (!mqtt.connected()) return;
   StaticJsonDocument<480> doc;
   doc["device_uid"] = deviceUid;
   doc["machine_code"] = machineCode;
   doc["pzem_ok"] = pzemOk;
   doc["sensor_ok"] = pzemOk;
   doc["voltage_v"] = lastV;
   doc["current_a"] = lastA;
   doc["power_w"] = lastW;
   doc["energy_kwh"] = lastE;
   doc["frequency_hz"] = lastHz;
   doc["power_factor"] = lastPf;
   doc["op_status"] = statusStr(opStatus);
   doc["run_sec"] = runSec;
   doc["loss_sec"] = lossSec;
   doc["off_sec"] = offSec;
   doc["power_on_sec"] = runSec + lossSec;
   doc["productivity_pct"] = productivityPct();
   doc["current_threshold_a"] = currentThresholdA;
   doc["power_threshold_w"] = powerThresholdW;
   doc["fail_count"] = pzemFailCount;
   doc["mqtt_service"] = mqttHost;
   doc["login_required"] = loginSystemOn;
   doc["operator_logged_in"] = operatorLoggedIn;
 
   char buf[480];
   size_t n = serializeJson(doc, buf);
   mqtt.publish(topicTelemetry, (const uint8_t *)buf, n, false);
 }
 
 void handleButtons() {
   uint32_t now = millis();
   bool pageUp = digitalRead(BTN_PAGE) == HIGH;
   bool resetUp = digitalRead(BTN_RESET) == HIGH;
 
