rusdifn08/RFID_Tracking/arduino/esp32c6_pzem_lcd_mqtt_no_button/esp32c6_pzem_lcd_mqtt_no_button.ino
   if (!pageUp && btnPagePrev) btnPageDownMs = now;
   if (pageUp && !btnPagePrev && (now - btnPageDownMs) > BTN_DEBOUNCE_MS) {
     lcdPage = (LcdPage)((lcdPage + 1) % lcdSlideCount());
     lcdScrollPos = 0;
     lcdManualHold = true;
     lastPageAutoMs = now;
     renderLcd();
   }
   btnPagePrev = pageUp;
 
   if (!resetUp && btnResetPrev) btnResetDownMs = now;
   if (!resetUp && (now - btnResetDownMs) >= BTN_LONG_MS && btnResetDownMs > 0) {
     resetDayCounters("btn_long");
     publishStatus("ok", "day reset via button", pzemOk);
     btnResetDownMs = 0;  // cegah spam
     lcdPage = PAGE_RUNLOSS;
     renderLcd();
   }
   if (resetUp) btnResetDownMs = 0;
   btnResetPrev = resetUp;
 }
 

 void setup() {
   delay(300);
   pinMode(BTN_PAGE, INPUT_PULLUP);
   pinMode(BTN_RESET, INPUT_PULLUP);

   loadIdentity();
   buildTopics();
   loadCounters();  // lanjutkan Run/Loss setelah restart
   loadDailyHistory(); // load memori riwayat 7 hari (1 minggu)
   loadCalibration();
   loadLoginState();

   Wire.begin(I2C_SDA, I2C_SCL);
   lcd.init();
   lcd.backlight();

   bool fromDeepSleep = (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_TIMER);
 
   if (!fromDeepSleep) {
     showUidSplashLcd(2000);
     showMacSplashLcd(2500);
   }
 
   PZEM_UART.begin(9600, SERIAL_8N1, PZEM_RX_PIN, PZEM_TX_PIN);
   delay(400);
 
   if (fromDeepSleep) {
     handleDeepSleepWake();  // set dsWakeWatch atau dsPendingExit — tidak sleep langsung
   }
 
   mqtt.setServer(mqttHost, MQTT_PORT);
   mqtt.setCallback(onMqttMessage);
   mqtt.setBufferSize(1536);
   mqtt.setKeepAlive(MQTT_KEEPALIVE_SEC);
   mqtt.setSocketTimeout(MQTT_SOCKET_TIMEOUT_SEC);
 
   WiFi.mode(WIFI_STA);
 
   // Boot / wake: selalu coba WiFi (wake deep sleep juga butuh MQTT)
   showConnLcd(fromDeepSleep ? "Wake WiFi" : "Connecting WiFi", wifiSsid);
   wifiBeginCurrent();
   uint32_t bootWifiStart = millis();
   bool bootWifiOk = false;
   while ((millis() - bootWifiStart) < BOOT_WIFI_TIMEOUT_MS) {
     if (WiFi.status() == WL_CONNECTED) {
       bootWifiOk = true;
       break;
     }
     delay(200);
     uint32_t elapsed = millis() - bootWifiStart;
     uint32_t remaining = (BOOT_WIFI_TIMEOUT_MS > elapsed) ? ((BOOT_WIFI_TIMEOUT_MS - elapsed) / 1000) : 0;
     char countLine[17];
     snprintf(countLine, sizeof(countLine), "%.10s %luds", wifiSsid, (unsigned long)remaining);
     showConnLcd(fromDeepSleep ? "Wake WiFi" : "Connecting WiFi", countLine);
   }
  if (bootWifiOk) {
    wifiWasOk = true;
    wifiAllFailed = false;
    wifiPhase = WP_PRIMARY;
    wifiDownSinceMs = 0;
    syncMqttHostFromWifi();
    saveIdentity();
    mqtt.setServer(mqttHost, MQTT_PORT);
    configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVER);
     showConnLcd("WiFi OK!", WiFi.localIP().toString().c_str());
     delay(600);
   } else {
     showConnLcd("WiFi Retry", DEFAULT_WIFI_SSID);
     delay(500);
   }
 
   if (WiFi.status() != WL_CONNECTED) {
     wifiResetCycle();
   }
   lastTickMs = millis();
   lastPageAutoMs = millis();
   offSinceMs = 0;
 }
 
 void loop() {
   uint32_t now = millis();
   if (wifiCredsDirty) {
     wifiCredsDirty = false;
     wifiAllFailed = false;
     wifiBeginCurrent();
   }
 
   if (mqttNeedsReconnect) {
     mqttNeedsReconnect = false;
     if (mqtt.connected()) {
       mqtt.disconnect();
     }
   }
 
   ensureWifi();
   if (WiFi.status() == WL_CONNECTED) {
     if (!mqtt.connected()) {
       ensureMqtt();
     } else {
       mqtt.loop();
     }
     checkWibMidnight();
   }
 
   // Reboot hanya jika semua WiFi sudah gagal lama (failover masih jalan → jangan restart)
   bool fullyOnline = (WiFi.status() == WL_CONNECTED) && mqtt.connected();
   if (fullyOnline || !wifiAllFailed) {
     offlineSinceMs = 0;
   } else {
     if (offlineSinceMs == 0) offlineSinceMs = now;
     if ((now - offlineSinceMs) >= RECOVERY_REBOOT_MS) {
       saveCounters(true);
       delay(120);
       ESP.restart();
     }
   }
 
   // Service MQTT sering (keepalive + inbound cmd) — hindari blocking lama tanpa loop
   if (mqtt.connected()) {
     mqtt.loop();
   }
 
   if (now - lastPzemMs >= PZEM_MS) {
     lastPzemMs = now;
     readPzem();
     tickTimers();
     if (mqtt.connected()) mqtt.loop();
 
     // Deep sleep: OFF terus ≥ 2 jam → wajib MQTT dulu
     if (opStatus == ST_OFF) {
       if (offSinceMs == 0) offSinceMs = now;
       else if ((now - offSinceMs) >= OFF_BEFORE_SLEEP_MS && !dsWakeWatch) {
         tryEnterDeepSleepWithMqtt("off_2h", true);
       }
     } else {
       offSinceMs = 0;
     }
   }
 
   serviceDeepSleepLogic();
 
   // Simpan berkala (juga saat offline)
   if (countersDirty) saveCounters(false);
 
   if (mqtt.connected() && (now - lastTelemetryMs >= TELEMETRY_MS)) {
     lastTelemetryMs = now;
     publishTelemetry();
     mqtt.loop();
   }
 
   if (mqtt.connected() && (now - lastStatusMs >= STATUS_MS)) {
     lastStatusMs = now;
     if (pzemOk) publishStatus("ok", "ESP-C6+PZEM sehat", true);
     else publishStatus("sensor_fail", "ESP online, PZEM gagal", false);
     mqtt.loop();
   }
 
   handleButtons();
 
   if (!lcdManualHold && (now - lastPageAutoMs >= lcdAutoMs)) {
     lastPageAutoMs = now;
     lcdPage = (LcdPage)((lcdPage + 1) % lcdSlideCount());
     lcdScrollPos = 0;
   }
   if (lcdManualHold && (now - lastPageAutoMs >= 12000)) lcdManualHold = false;
 
   if (now - lastLcdMs >= LCD_MS) {
     lastLcdMs = now;
     renderLcd();
   }
 }
 